[
  {
    "episode_id": "54",
    "wp_id": 938,
    "slug": "episode-054-lawyer-talk-with-donovan-francis",
    "title": "54: Lawyer Talk with Donovan Francis",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20230705_010741_0834de248ed505f7e67766d724b33bb3.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2023/06/episode-054-lawyer-talk-with-donovan-francis.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=ftJ8ineyunI",
    "youtube_full": "https://www.youtube.com/watch?v=IKl_Flac9yI",
    "keywords": ["law", "lawyer"],
    "published": 1688564339000,
    "time": "27:44",
    "preview_description": "Join us on The Job Talk Podcast with Donovan H. Francis, founder of GOOSELAW™ Immigration. From helping multinational corporations to Canadian startups navigate intricate immigration laws, Donovan's story as a proud immigrant and lawyer is not one to miss. Discover his insights on Canadian immigration services, past experiences, and his recent engagements.",
    "description": "<h2>Lawyer Talk with Donovan Francis</h2><p><a href=\"https://gooselaw.com\">https://gooselaw.com</a></p><p>Profile of our guest in this episode of The Job Talk Podcast:Donovan H. Francis is Founder and Managing Lawyer at Ontario registered law firm, GOOSELAW™ Immigration, located in the Greater Toronto Area, Canada.Donovan currently helps businesses inside Canada and from around the world bring talent to Canada without dealing with complicated immigration laws. He leads a team of lawyers and immigration support workers dedicated to helping billion-dollar multinational corporations, Canadian and foreign owned startups as well as medium-sized companies seeking work permit support for their foreign employees or wishing to create a Canadian startup for immigration purposes.He leverages his expertise as a Canadian educated lawyer, a go-to marketing and communications professional, and a proud immigrant to Canada, to provide high-quality Canadian immigration services. He leads his team in helping Canadian and foreign employers navigate complex immigration regulations, including those related to international trade agreements such as NAFTA, CETA and GATS. Donovan also provides direction related to various work permit categories, including intra-company transferees and labour market impact assessments and Global Skills Strategy applications.</p><h2>PREVIOUS EXPERIENCE</h2><p>In the past, he worked as a business immigration lawyer at a global corporate immigration law firm where he advised a diverse portfolio of clients, including global corporations and Fortune 500 companies, as well as small and medium-sized companies.He has also served as head of communications and marketing within a division of global engineering firm, Worley. He provided the company’s leadership team with strategic marketing, advertising, and internal communications advice around multiple long and short-term corporate outcomes.</p><h2>QUALIFICATION HIGHLIGHTS</h2><p>Donovan is a member in good standing of the Law Society of Ontario and has been admitted to the Ontario Court of Appeal and the Ontario Superior Court of Justice. He is also a member of the Canadian Bar Association and the Canadian Association of Black Lawyers. Under appointment under The Notaries Act, RSO 1990, Donovan is a certified Notary Public & Commissioner.A graduate of Osgoode Hall Law School in Toronto, Canada, Donovan holds a Juris Doctor (Law degree) and a master’s degree in Communications and Technology from the University of Alberta, Canada. He is also a proud alum of the University of The West Indies (Mona) in Jamaica.</p><h2>BOARD DIRECTORSHIP AND COMMUNITY INVOLVEMENT</h2><p>Donovan has held positions on several boards and committees and has served in advisory and managerial role for different political campaigns in Alberta and Ontario. He is currently the Director of Human Resources & Legal Affairs at CANCARO (Canadian, Migration & Counter Trafficking in Persons Organization). He has served as Communications Director, CARIWEST Festival (Western Canada’s largest Caribbean street festival) as well as on the M.A. in Communications and Technology Advisory Board at the University of Alberta. He also served on the Faculty of Extension Awards Committee also at the University of Alberta.</p><h4>Need More?</h4><p>Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2023_07_05_13_37_54_41e56a38-ef99-42f9-ae82-2e9f3d3cb92f.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "53",
    "wp_id": 928,
    "slug": "episode-053-police-talk-with-sgt-angie-tetley-and-cst-brennan-martin",
    "title": "53: Police Talk with Sgt. Angie Tetley and Cst. Brennan Martin",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20230628_010651_27ecef15cc669764bb887d0b1aca0be1.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2023/06/Episode-053-Police-Talk-with-Sgt.-Angie-Tetley-and-Cst.-Brennan-Martin-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=Iqq7jC-qcsg",
    "youtube_full": "https://www.youtube.com/watch?v=DIBEs1hau6k",
    "keywords": ["Constable", "law enforcement", "police", "Sargent"],
    "published": 1687915877000,
    "time": "1:19:59",
    "preview_description": "Join us on The Job Talk Podcast, where we interview CPS veterans Sgt. Angie Tetley and Const. Martin. Discover their diverse roles in law enforcement, their journey in CPS Recruiting Unit, and initiatives like Run with a Recruiter. Gain insights into a police career, its requirements, outlook, and more.",
    "description": "<p>Police Talk with Sgt. Angie Tetley and Cst. Brennan MartinVisit: </p><p><a href=\"https://join.calgarypolice.ca\">https://join.calgarypolice.ca</a></p><p><strong>Our guests on The Job Talk Podcast:</strong></p><p>Sgt. Angie Tetley, with over 20 years in the Calgary Police Service (CPS), recently joined the CPS Recruiting Unit as the outreach sergeant. She served in numerous roles, including frontline patrol, recruit training instructor, competition coordinator in HR, and operational planning in the Major Events and Emergency Management Section. Tetley is also the Training Director for the Alberta Women in Public Safety and Chair of Calgary Women in Policing. She's married to a firefighter and is proud of her rugby-playing daughters.</p><p>Const. Brennan Martin, a sociology graduate, commenced his policing career in 2003. Recently, he joined the CPS Recruiting Unit as a recruiting and outreach officer, attracting experienced officers to join CPS. He co-facilitates the Run with a Recruiter program, which informs participants about the CPS application process and life as a police officer. Martin's CPS career includes frontline patrol, drug investigations, gang suppression, and establishing relationships with vulnerable communities via beat teams. Off-duty, he enjoys rural life with his family and volunteering as a hockey coach.</p><p>Police officers safeguard the public, detect and prevent crime, and maintain law and order. They're employed by municipal, federal, and some provincial and regional governments. The employment outlook is promising.</p><p>Requirements include secondary school completion, a college or university degree, a police training program, physical fitness, and possibly psychological tests.</p><p>Constable experience and specialized courses are required for detectives and sergeants.</p><p>For more, visit our <strong>Career Crisis Interview Series</strong>:</p><p><a href=\"https://thejobtalk.com/help\"><strong>https://thejobtalk.com/help</strong></a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2023_06_28_01_29_29_0c62d75a-ebc9-42e4-a9c9-3aa6e69ffb69.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "52",
    "wp_id": 859,
    "slug": "episode-052-firefighter-talk-with-kevin-royle",
    "title": "52: Firefighter Talk with Kevin Royle",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221207_061240_be8b4c44532d71c50980896079776007.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/12/the-job-talk-podcast-episode-052-Kevin-Royle-PosterImage-jpg.webp",
    "youtube_preview": "https://www.youtube.com/watch?v=2eAx9KfST0A",
    "youtube_full": "https://www.youtube.com/watch?v=d9LqMzOKe8g",
    "keywords": ["Firefighter"],
    "published": 1670436276000,
    "time": "30:46",
    "preview_description": "Kevin Royle, a 14 year veteran with Edmonton Fire Rescue Services, is a First Class Firefighter, Firefighter Medical Responder, Apparatus operator, and Fire Investigator.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-052-firefighter-talk-with-kevin-royle/\"><strong>Firefighter Talk with Kevin Royle</strong></a></p><p>Kevin Royle, a 14 year veteran with Edmonton Fire Rescue Services, is a First Class Firefighter, Firefighter Medical Responder, Apparatus operator, and Fire Investigator.</p><p>Kevin founded Firefighter Aid Ukraine in 2014 and remains the project director. Firefighter Aid Ukraine has delivered over 209 tons of aid to first responders and hospitals to Ukraine. The organization has also sent or helped to send equipment such as fire trucks, medical supplies, firefighting rescue equipment, and PPE to other countries such as Lebanon, Chile, Paraguay, Syria, Mexico, the Philippines, India, and Cuba. They have continued working in Ukraine throughout the conflict.</p><p>Kevin was the recipient of the Hetman Award for his work in Ukraine, and was recently appointed to the Premier’s AdvisoryTask force on Ukraine. Kevin has a beautiful wife and is the father of two young children. When not working or volunteering, Kevin enjoys skiing and travelling the world.</p><p>When the conflict started, FAU used their trusted network to focus on the immediate delivery of critical aid to Ukraine. In a week, the organization accomplished what typically takes well over a year collecting 14 tones of critically needed life rescue equipment, PPE, and medical supplies, chartered a cargo plane, and departed from the Edmonton International Airport on March 10th. In less than 24hrs of landing in Europe, FAU and AUCC personally delivered two-semi trucks full of equipment into Ukraine and handed them off to our contacts in the State Emergency Services. Within days of that equipment being provided, it was on the front lines of the war and making international news, as seen on CNN.</p><p>FAU’s will continue to collect critical aid and ship it to the front lines and communities affected by the Russian invasion of Ukraine.</p><p><strong>Description</strong></p><p>Firefighters carry out firefighting and fire prevention activities, and assist in other emergencies. They are employed by municipal, provincial and federal governments and by large industrial establishments that have internal firefighting services. Apprentices are also included in this unit group.</p><p><strong>Job Forecast</strong></p><p>Visit: <a href=\"https://www.jobbank.gc.ca/marketreport/outlook-occupation/6279/ca\">https://www.jobbank.gc.ca/marketreport/outlook-occupation/6279/ca</a></p><p><strong>Employment Requirements</strong></p><p>This is what you typically need for the job:</p><ul><li><p>Completion of secondary school is usually required.</p></li><li><p>Completion of a college program in fire protection technology, fire science or a related field may be required.</p></li><li><p>Firefighting and emergency medical care training courses are provided and vary in length depending on the requirements of different fire departments or services.</p></li><li><p>An apprenticeship training program for firefighters and voluntary trade certification is available in New Brunswick.</p></li><li><p>Experience as a volunteer firefighter may be an advantage.</p></li><li><p>Physical agility, strength, fitness and vision requirements must be met.</p></li><li><p>Several years of experience are required for senior firefighters, such as lieutenants and captains.</p></li></ul><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_12_07_18_04_03_dd20df4c-745a-44d9-94c0-2afe663bf5dc.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "51",
    "wp_id": 850,
    "slug": "episode-051-environmental-professional-talk-with-ryan-muri",
    "title": "51: Environmental Professional Talk with Ryan Muri",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221207_051247_054cbc96f5767255b03ca22db25ef735.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/12/the-job-talk-podcast-episode-051-Ryan-Muri-posterImage-jpg.webp",
    "youtube_preview": "https://www.youtube.com/watch?v=M-cszakfQn4",
    "youtube_full": "https://www.youtube.com/watch?v=lMrbj-BlB4M",
    "keywords": ["Environmental Professional"],
    "published": 1670435638000,
    "time": "24:26",
    "preview_description": "Ryan Muri is from a rural background in North Central Alberta in a region with significant energy activity. He was able to obtain some “environmental” experience and exposure to the environmental consulting industry prior to selecting environmental sciences as his primary focus at post secondary.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-051-environmental-professional-talk-with-ryan-muri/\"><strong>Environmental Professional Talk with Ryan Muri</strong></a></p><p>Ryan Muri is from a rural background in North Central Alberta in a region with significant energy activity. He was able to obtain some “environmental” experience and exposure to the environmental consulting industry prior to selecting environmental sciences as his primary focus at post secondary.</p><p>Ryan received his Bachelor of Science in Environmental and Conservation Sciences (ENCS) with a minor in Soil science in 2001 from the University of Alberta. He then received his Professional Agrologist designation in Alberta in 2003. Ryan began his career as an Environmental professional in 2001 with a small Edmonton based private consulting firm in the spring of 2001. After 12 years (8 of which were primarily field based) and 2 “boom and bust” cycles associated with the energy sector, Ryan moved into an industry role with Husky Energy (now Cenovus Energy) in 2013. </p><p>In 2017 Ryan moved back into consulting and in 2018, joined Vertex Professional Services (parent company – Vertex Resource Group). Initially the role was General Manager of Environment North. As a result of significant company growth in the environmental division and a decision to re-structure by sector instead of by region, Ryan was appointed as Vice President of Regulatory and Compliance Monitoring early in 2022. The team that Ryan facilitates supports projects in the following sectors across Canada; renewables, transmission lines, pipelines, Sand and Gravel, Oil Sands, commercial and residential developments, and supports various clients on green initiatives.</p><p>Ryan is married and has two children, Caleb, and Camryn and still calls the Edmonton region home.</p><p><strong>Description</strong></p><p>What can you do as an Environmental Professional? The list is long and diverse, and individuals come form a wide range of educational and speciality backgrounds. Some of the career paths include: (but not limited to):</p><p>Biophysical Sciences (Natural Sciences) Wildlife Biology Fisheries and Aquatics Soil and Reclamation professionals Vegetation and Wetland Ecology Groundwater (Hydrogeology) Surface Water professionals Contaminated Sites Management Assessment and remediation Risk assessment and human health toxicology Spill response professionals Contaminant hydrogeology</p><p><strong>Job Forecast</strong></p><p>Increased sector development in Canada (i.e. renewables, increased green initiatives) and in increase in regulatory and stakeholder engagement in the development and restoration/reclamation of projects have led to a increase in demand for Environmental Professionals. Specific to Western Canada there is a shortage across the board for all areas associated with pre-development assessments scopes, regulatory permitting and management and closure of impacted sites.</p><p><strong>Employment Requirements</strong></p><p>Most industries that employ Environmental Professionals do require post secondary education associated with a related field for entry level positions. This includes two- or three-year technical diplomas from accredited colleges and technical institutes or a Bachelors degree. With increased specialization in a specific discipline, higher level education is often obtained. Most Environmental Professionals work towards a professional designation that accommodates the work types and areas in which they practice. </p><p>Education requirements and professional designations do vary by province and governing body.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_12_07_17_53_49_4654fd14-1169-42e7-8c88-a9ab12d489fe.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "50",
    "wp_id": 844,
    "slug": "episode-050-psychologist-talk-with-michaela-kadambi",
    "title": "50: Psychologist Talk with Michaela Kadambi",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221207_051242_6a9c08e5e727d7272c010bd46c6ca729.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/12/the-job-talk-podcast-episode-050-Michaela-Kadambi-jpg.webp",
    "youtube_preview": "https://www.youtube.com/watch?v=-kxuJbVgkB4",
    "youtube_full": "https://www.youtube.com/watch?v=xDzweKdpnsA",
    "keywords": ["Psychologist"],
    "published": 1670434133000,
    "time": "52:53",
    "description": "<p><a href=\"https://thejobtalk.com/episode-050-psychologist-talk-with-michaela-kadambi/\"><strong>Psychologist Talk with Michaela Kadambi</strong></a></p><p>Michaela Kadambi Ph.D., R. Psych. (she/her): is a BIPOC (South Asian/European) registered psychologist in Edmonton who specializes in anxiety disorders and traumatic stress. Having the highest levels of education and training experiences required for psychologists in Alberta, she offers in-person and telehealth services to individuals and couples. Her clinical work is deeply informed by current research, best practices, advanced clinical training, and over two decades of professional experience. Dr. Kadambi is a Certified Perinatal Mental Health Professional through Post-Partum International and is a certified consultant in Prolonged Exposure therapy through the Center for the Treatment and Study of Anxiety (Division of Pennsylvania State University). Diversity is celebrated in her practice. Clients from all backgrounds, religions, sexual orientations, and gender expressions are welcomed for individual or couples counselling.</p><p><strong>Description</strong></p><p>Psychologists assess and diagnose behavioral, emotional and cognitive disorders, counsel clients, provide therapy, conduct research and apply theory relating to behavior and mental processes. Psychologists help clients work toward the maintenance and enhancement of psychological, physical, intellectual, emotional, social and interpersonal functioning. They work in private practice or in clinics, correctional facilities, hospitals, mental health facilities, rehabilitation centres, community service organizations, businesses, schools and universities, and in government and private research agencies.</p><p><strong>Job Forecast</strong></p><p>For Psychologists, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 15,700 , while 13,700 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p>With regard to labour supply, psychologists are a regulated occupation and in most provinces in Canada workers need to have a doctorate degree in order to be able to work. Without a PhD degree, workers must work in some closely related occupations for some years before being granted the right to work as a psychologist. As a result, occupational movers are projected to account for the majority of job seekers.</p><p></p><p><strong>Employment Requirements</strong></p><p>A doctoral degree in psychology is required in order to use the designation “Psychologist” in Quebec, Ontario, Manitoba and British Columbia.</p><p>A master’s degree in psychology is required for the designation “Psychologist” in Newfoundland and Labrador, Nova Scotia, New Brunswick, Saskatchewan, Alberta and the Northwest Territories.</p><p>A master’s degree in psychology is required in order to use the designation “Psychological Associate” in Ontario and Manitoba.</p><p>In Prince Edward Island, a doctoral degree is required to work in private practice, or a master’s degree with practice limited to institutions and agencies.</p><p></p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_12_07_17_28_45_973cbcc1-0372-4109-9fcd-055a0691b2e6.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "49",
    "wp_id": 835,
    "slug": "episode-049-headshot-photographer-talk-with-jeanette-sesay",
    "title": "49: Headshot Photographer Talk with Jeanette Sesay",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221207_041251_72fae588cd81eb209fa3706778aec11a.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/12/the-job-talk-podcast-episode-049-JeanetteSesay-jpg.webp",
    "youtube_preview": "https://www.youtube.com/watch?v=bqvoj3kKrNU",
    "youtube_full": "https://www.youtube.com/watch?v=YBlzGPwtF3Y",
    "keywords": ["photographer"],
    "published": 1670429803000,
    "time": "29:35",
    "preview_description": "Jeanette Sesay is the owner of a high-end headshot business where she photographs anyone from top executives to dental assistants and young actors.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-049-headshot-photographer-talk-with-jeanette-sesay/\"><strong>Headshot Photographer Talk with Jeanette Sesay</strong></a></p><p>Jeanette Sesay is the owner of a high-end headshot business where she photographs anyone from top executives to dental assistants and young actors. She has been working as a photographer since graduating from the NAIT Photographic Technology program in 2010. Her careers with both NAIT and the University of Alberta have brought her photography onto billboards, buses, magazines and promotional materials across the country. She’s volunteered as a photographer for an NGO in Uganda, photographed an event in Paris and captured countless weddings and family sessions.</p><p>After her time in the spotlight she started a family and as a mom she was looking for a career that she was able to do while also parenting three young boys. While she was working in the corporate world she dreamed of owning her own business capturing headshots for professionals but it was so hard to leave a secure position with regular pay and benefits for the unknown. Finally, while pregnant with her third son she and her husband decided it was time to get that dream started and in the height of COVID she perfected her lighting style and built up a portfolio of images to be used for her promo materials. Since then the business has taken on a life of its own and it’s almost impossible to keep up with both the business and life at home with the boys.</p><p>When she first studied photography she had no intention whatsoever to make it a career so the direction her life has taken still surprises her all the time!</p><p><strong>Description</strong></p><p>Photographers operate still cameras to photograph people, events, scenes, materials, products and other subjects. They are employed by photographic studios, newspapers, magazines, museums and government, or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>In order to determine the expected outlook of an occupation, the magnitude of the difference between the projected total numbers of new job seekers and job openings over the whole projection period (2019-2028) is analyzed in conjunction with an assessment of labour market conditions in recent years. The intention is to determine if recent labour market conditions (surplus, balance or shortage) are expected to persist or change over the period 2019-2028. For instance, if the analysis of key labour market indicators suggests that the number of job seekers was insufficient to fill the job openings (a shortage of workers) in an occupational group in recent years, the projections are used to assess if this situation will continue over the projection period or if the occupation will move towards balanced conditions.</p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>This is what you typically need for the job: A bachelor’s degree in visual arts with specialization in photography or Completion of specialized training in photography in high school, college or specialized training schools or Extensive on-the-job training under the supervision of a photographer is required. Experience in, or knowledge of computerized photography or digital imaging may be required.</p><p>Creative and technical ability, as demonstrated by a portfolio of work, are required.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_12_07_16_16_13_ea49a781-457a-4ae2-965a-d5d23bb30746.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "48",
    "wp_id": 829,
    "slug": "episode-048-digital-communications-specialist-talk-with-liz-pittman",
    "title": "48: Digital Communications Specialist Talk with Liz Pittman",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221207_041252_a140229f217cfa9626fcd01736a8eb61.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/12/the-job-talk-podcast-Liz-Pittman-episode-048.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=Jy29HEeJH-k",
    "youtube_full": "https://www.youtube.com/watch?v=wtlDuY3IPqU",
    "keywords": ["communications specialist"],
    "published": 1670429036000,
    "time": "30:51",
    "preview_description": "Liz Pittman is a freelance digital communications specialist in Victoria, BC. She works with clients across North America on social media strategy and management, content creation, web writing, and podcasting.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-048-digital-communications-specialist-talk-with-liz-pittman/\"><strong>Digital Communications Specialist Talk with Liz Pittman</strong></a></p><p>Liz Pittman is a freelance digital communications specialist in Victoria, BC. She works with clients across North America on social media strategy and management, content creation, web writing, and podcasting.</p><p>Liz is also a part-time instructor at the University of Victoria, where she teaches a couple of days per week. Her main courses are Social Media Marketing and Digital Communication, which are credit programs that are applied to Business Administration Certificates and Diplomas.</p><p>Her formal education is in broadcast journalism. She worked in that industry for six years before moving into digital marketing and communications.</p><p><strong>Description</strong></p><p>Advertising, marketing, public relations and e-business managers plan, organize, direct, control and evaluate the activities of establishments and departments involved in commercial, industrial and e-business advertising, marketing and public relations. They are employed by commercial and industrial establishments, government departments, and advertising, marketing and public relations firms or consulting businesses.</p><p><strong>Job Forecast</strong></p><p>n order to determine the expected outlook of an occupation, the magnitude of the difference between the projected total numbers of new job seekers and job openings over the whole projection period (2019-2028) is analyzed in conjunction with an assessment of labour market conditions in recent years. The intention is to determine if recent labour market conditions (surplus, balance or shortage) are expected to persist or change over the period 2019-2028. For instance, if the analysis of key labour market indicators suggests that the number of job seekers was insufficient to fill the job openings (a shortage of workers) in an occupational group in recent years, the projections are used to assess if this situation will continue over the projection period or if the occupation will move towards balanced conditions.</p><p>The analysis of key labour market indicators such as job vacancies and employment growth as well as the unemployment rate suggests that the number of job seekers was sufficient to fill the job openings in this occupational group over the 2016-2018 period.</p><p>For Advertising, marketing and public relations managers & Other business services managers, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 19,400 , while 19,900 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>A university degree or college diploma in a field related to electronic commerce, Web site content development, or Internet services and Experience in Web site design, interactive media development, data administration or information systems analysis or experience related to Web site content are usually required.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_12_07_16_03_14_ca7ec509-0405-46ec-8b35-d3e43b9936f9.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "47",
    "wp_id": 802,
    "slug": "episode-047-entrepreneur-community-leader-talk-with-james-cumming",
    "title": "47: Entrepreneur & Community Leader Talk with James Cumming",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221103_011135_09c9a5fbc3953758d6ce329af708f204.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/11/Entrepreneur-Community-Leader-Talk-with-James-Cumming-The-Job-Talk-Episode-047.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=sDWMzyosS4U",
    "youtube_full": "https://www.youtube.com/watch?v=reQkb94vrxM",
    "keywords": ["Entrepreneur"],
    "published": 1667483864000,
    "time": "31:21",
    "preview_description": "James Cumming is the former President & CEO of the Edmonton Chamber of Commerce, the largest urban chamber in Canada, James is an active leader in Edmonton’s business and non-profit volunteer communities.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-047-entrepreneur-community-leader-talk-with-james-cumming/\"><strong>Entrepreneur & Community Leader Talk with James Cumming</strong></a></p><p>James Cumming is the former President & CEO of the Edmonton Chamber of Commerce, the largest urban chamber in Canada, James is an active leader in Edmonton’s business and non-profit volunteer communities.</p><p>As a life-long entrepreneur, James understands the focus and drive needed to build something from scratch – whether starting out as an independent business owner or becoming the Chair of NAIT’s Board of Governors.</p><p>With entrepreneurship comes an inherent responsibility to give back to your community. This is why James has actively supported non-profit organizations such as Junior Achievement, Northlands Park, Edmonton Construction Association, Alberta Art Stabilization Fund, Norlien Foundation, Alberta Opportunity Corporation, and the Muscular Dystrophy Association of Canada, to name a few. A recipient of NAIT’s Alumni Award of Distinction and Top 50 Alumni, James is a current member of the World Presidents’ Organization and the Harvard University Alumni OPM 27.</p><p>A lifelong Edmontonian born and raised in Edmonton Centre, James and his wife Debbie have been married for 35 years. They are the proud parents of three beautiful children, and are grandparents.</p><p><strong>Description</strong></p><p>An entrepreneur is an individual who takes the risk to start their own business based on an idea they have or a product they have created while assuming most of the risks and reaping most of the rewards of the business.</p><p><strong>Job Forecast</strong></p><p>In 2019, there were 1,143,610 active enterprises in Canada with one or more employees. Of those, 64.6% had four employees or less. In the same year, there were 79,530 births and 90,710 deaths of enterprises. The construction sector represented the largest number of high-growth enterprises by employment and by revenue. With 1,140 high-growth enterprises by employment and 2,530 high-growth enterprises by revenue, this sector accounted for 15.9% and 19.5% of the total, respectively.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_11_03_13_57_36_e2d0fa00-215f-48ed-bca2-5ac820f43626.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "46",
    "wp_id": 793,
    "slug": "episode-046-emergency-room-nurse-talk-with-teresa-berdusco",
    "title": "46: Emergency Room Nurse Talk with Teresa Berdusco",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221103_011102_7724a754cde3c3da617a9bf8b02b9971.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/11/Emergency-Room-Nurse-Talk-with-Teresa-Berdusco-The-Job-Talk-Episode-046.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=CpCUCVfmG1Q",
    "youtube_full": "https://www.youtube.com/watch?v=BZFqvjFsiQk",
    "keywords": ["Nurse"],
    "published": 1667482876000,
    "time": "36:52",
    "preview_description": "Teresa Berdusco, is an Emergency Room Nurse and a UNA member. She has volunteered to provide medical aid in many countries that have suffered natural disasters or conflict.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-046-emergency-room-nurse-talk-with-teresa-berdusco/\"><strong>Emergency Room Nurse Talk with Teresa Berdusco</strong></a></p><p>Teresa Berdusco, is an Emergency Room Nurse and a UNA member. She has volunteered to provide medical aid in many countries that have suffered natural disasters or conflict. Most recently she volunteered to provide aid in Ukraine.</p><p><strong>Description</strong></p><p>Registered nurses and registered psychiatric nurses provide direct nursing care to patients, deliver health education programs and provide consultative services regarding issues relevant to the practice of nursing. They are employed in a variety of settings including hospitals, nursing homes, extended care facilities, rehabilitation centres, doctors’ offices, clinics, community agencies, companies, private homes and public and private organizations or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>In order to determine the expected outlook of an occupation, the magnitude of the difference between the projected total numbers of new job seekers and job openings over the whole projection period (2019-2028) is analyzed in conjunction with an assessment of labour market conditions in recent years. The intention is to determine if recent labour market conditions (surplus, balance or shortage) are expected to persist or change over the period 2019-2028. For instance, if the analysis of key labour market indicators suggests that the number of job seekers was insufficient to fill the job openings (a shortage of workers) in an occupational group in recent years, the projections are used to assess if this situation will continue over the projection period or if the occupation will move towards balanced conditions.</p><p>The analysis of key labour market indicators such as job vacancies and employment growth as well as the unemployment rate suggests that the number of job openings exceeded substantially the number of job seekers in this occupational group over the 2016-2018 period.</p><p>For Registered nurses and registered psychiatric nurses, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 191,100 , while 154,600 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p>The labour shortage conditions seen in recent years is expected to persist into the 2019-2028 period, and could even become more acute as the projected number of job openings is expected to be substantially larger than the projected number of job seekers over that period.</p><p><strong>Employment Requirements</strong></p><p>Completion of a university, college or other approved registered nursing program is required.</p><p>Additional academic training or experience is required to specialize in a specific area of nursing.</p><p>A master’s or doctoral degree in nursing is usually required for clinical nurse specialists, clinical nurses, nursing consultants and nursing researchers. Registration with a regulatory body is required in all provinces and territories.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_11_03_13_41_03_8f44e195-0a0c-49e3-9798-f51a2723cf4a.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "45",
    "wp_id": 781,
    "slug": "episode-045-orthodontist-talk-with-dr-sunny-leong",
    "title": "45: Orthodontist Talk with Dr. Sunny Leong",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221102_031155_ddffb7294bc026f1e288d3ef06f67f87.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/11/Orthodontist-Talk-with-Dr.-Sunny-Leong-the-job-talk-Episode-045.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=htKg49rzm0g",
    "youtube_full": "https://www.youtube.com/watch?v=EIkE5CUIoks",
    "keywords": ["Orthodontist"],
    "published": 1667402644000,
    "time": "44:59",
    "preview_description": "Dr. Sunny Leong or “Dr. Sunny”, as many know him, is back in the office. Dr. Leong has been practicing orthodontics for over 12 years.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-045-orthodontist-talk-with-dr-sunny-leong/\"><strong>Orthodontist Talk with Dr. Sunny Leong</strong></a></p><p>Dr. Sunny Leong or “Dr. Sunny”, as many know him, is back in the office. Dr. Leong has been practicing orthodontics for over 12 years. He has a conservative treatment approach, similar to the late Dr. Dietz. He welcomes patients from all over the South Edmonton area including Terwillegar South, Magrath Heights, Twin Brooks, Haddow, Windermere and Riverbend just to name a few. Many of his patients travel in from Leduc, Beaumont, Devon, Spruce Grove, Stony Plain and even as far as Edson, Whitecourt, and Camrose!</p><p>Dr. Sunny’s education included: University at Buffalo Dental School 2005; University of Florida Orthodontic Fellowship 2006; University of Minnesota Orthodontic Residency 2008; and University of Alberta Nursing 2000-2001.</p><p>Fun facts about Dr. Sunny: Dr. Sunny was raised in North Edmonton and attended Queen Elizabeth High School. He has been a die-hard Oilers fan since he was a child.</p><p>He has participated in 6 dental volunteer trips to bring free dental care to people around the globe. He has been to: Columbia, Cambodia, Nicaragua, Belize, Peru, and Guatemala.</p><p>He is the lead singer in the rock band GOOD ‘NUFF. He loves music so much that his dream job, if he wasn’t an orthodontist, would be to be a country singer in Nashville!</p><p>Dr. Sunny and his wife Misaki love to travel. Their absolute favourite place in the world is Hawaii! In fact, he and his wife got married there 3 years ago.</p><p>In his spare time, you can often find him on the golf course, trying to improve his game!</p><p><strong>Description</strong></p><p>Dentists diagnose, treat, prevent and control disorders of the teeth and mouth. They work in private practice or may be employed in hospitals, clinics, public health facilities or universities. </p><p>Dentists may specialize in such areas as oral and maxillofacial surgery, orthodontics, pediatric dentistry, periodontics, endodontics, prosthodontics, oral pathology, oral radiology or public health dentistry.</p><p><strong>Job Forecast</strong></p><p>Over the 2016-2018 period, employment growth in this occupational group was substantially above the average for all occupations. The unemployment rate fell to reach 0.9% in 2018, a rate slightly below its long-term trend and significantly below the national average of 5.8%. However, the large majority of workers in this occupation are self-employed (87%), which explains the low unemployment rate. On the other hand, the number of usual hours of work has remained very stable over the past years, a characteristic that is different from the downward trend observed for the overall Canadian labour market. Hence, analysis of key labour market indicators suggests that the number of job seekers was sufficient to fill the job openings in this occupational group.</p><p><strong>Employment Requirements</strong></p><p>This is what you typically need for the job:</p><ul><li><p>One to four years of pre-dentistry university studies or, in Quebec, completion of a college program in sciences and A university degree from a recognized dental program are required.</p></li><li><p>Licensing by a provincial or territorial regulatory body is required.</p></li><li><p>Dentists in general practice can move into a specialized practice through advanced training.</p></li><li><p>Licensing for specializations is required.</p></li></ul><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_11_02_15_23_57_0fb5e07c-5f1a-4046-bfbd-3233eb1615a8.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "44",
    "wp_id": 771,
    "slug": "episode-044-pharmacist-talk-with-cassandra-woit",
    "title": "44: Pharmacist Talk with Cassandra Woit",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221101_031143_47d98c69a6b3a95124cfd01fdd5e20c8.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/11/Pharmacist-Talk-with-Cassandra-Woit-The-Job-Talk-Episode-044.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=BDsU0vCQ0s8",
    "youtube_full": "https://www.youtube.com/watch?v=pjdJQAwzxFE",
    "keywords": ["Pharmacist"],
    "published": 1667316661000,
    "time": "34:40",
    "preview_description": "Today we talk with Cassandra Woit, MSc. Pharmacy Practice, BSc. Pharm, RPh., APA, who has worked in a variety of pharmacy practices since 2016.",
    "description": "<p><a href=\"https://thejobtalk.com/episode-044-pharmacist-talk-with-cassandra-woit/\"><strong>Pharmacist Talk with Cassandra Woit</strong></a></p><p>Cassandra Woit, MSc. Pharmacy Practice, BSc. Pharm, RPh., APA, has worked in a variety of settings and pharmacy practices since graduating from the University of Alberta in 2016. While completing her MSc in Pharmacy Practice she worked as pharmacist providing care to supportive living sites in and around Edmonton. In this role she collaborated with physicians, nursing staff and patients to quickly expand her practice and knowledge to provide comprehensive pharmacy services. She has also worked at different independent community pharmacies where she gained valuable experience in community practice as each pharmacy had a different patient population, workflow, and work environment. Upon completion of her master’s at the end of 2019, she transitioned to a practice site in the inner city where she developed additional experience in the fields of addictions and mental health.</p><p>In 2021 a new opportunity presented itself, and she joined a community pharmacy in Southwest Edmonton where she has been able to focus on the community’s needs while advocating for the profession. In her spare time you can find Cassandra reading a mystery novel, dancing, or working on a new crochet project.</p><p>Editor’s Note: “Pandemic stress, increase in harassment and staffing challenges exact heavy toll on pharmacy professionals. National survey data shows pharmacy teams are at risk of burnout at unprecedented levels … Adding to the pressure is an increase in frequent abuse and harassment with almost half (48%) experiencing abuse or harassment from patients at least weekly.”</p><p><strong>Description</strong></p><p>Community pharmacists and hospital pharmacists compound and dispense prescribed pharmaceuticals and provide consultative services to both clients and health care providers. They are employed in retail and health centre pharmacies, or they may be self-employed. Industrial pharmacists participate in the research, development, promotion and manufacture of pharmaceutical products. They are employed in pharmaceutical companies and government departments and agencies.</p><p><strong>Job Forecast</strong></p><p>For Pharmacists, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 12,500 , while 16,600 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p>Workers in this occupational group tend to retire at a later age than those in other occupations, limiting the number of positions that will be available due to retirement over the projection period. With regard to labour supply, due to the highly specialized nature of this occupation, school leavers are expected to account for the vast majority of job seekers. About one fifth of all job seekers are projected to be immigrants getting licensed through the provincial or territorial regulatory body for both community and hospital pharmacists. A sizeable number of workers are expected to seek opportunities in managerial positions in the health sector or as retail and wholesale trade managers (NOC 0621 – pharmacists opening their own drugstore).</p><p><strong>Employment Requirements</strong></p><p>A bachelor of science degree in pharmacy is required.</p><p>Pharmacists also require practical training under the supervision of a pharmacist.</p><p>Licensure is required in all provinces and territories for community and hospital pharmacists.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_11_01_15_30_44_dcf14018-1aa3-46c2-9df9-44703278a840.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "43",
    "wp_id": 758,
    "slug": "episode-043-investment-advisor-talk-with-dao-le",
    "title": "43: Investment Advisor Talk with Dao Le",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221024_061024_74fab96576605429a2e06945848a825c.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/10/Investment-Advisor-Talk-with-Dao-Le-The-Job-Talk-Podcast-Episode-043.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=PeRJXndcPXo",
    "youtube_full": "https://www.youtube.com/watch?v=nb3r8jVDbIQ",
    "published": 1666636296000,
    "time": "35:10",
    "description": "<p><a href=\"https://thejobtalk.com/episode-043-investment-advisor-talk-with-dao-le/\"><strong>Investment Advisor Talk with Dao Le</strong></a></p><p>Dao Le, MBA, CFA Dao began his career in the investment industry in 2002, following a four year stint as an Operations Manager for a manufacturing company in Delta, BC and a concurrent six years as an Officer in the Canadian Armed Forces Reserve. His finance career started on Bay Street in Toronto, where he worked for eight years on a trading floor.</p><p>Dao earned a Master of Business Administration degree from the University of British Columbia and was awarded the Charter Financial Analyst (CFA) designation in 2004. A CFA charter is widely considered the gold standard in the field of investment analysis and management.</p><p>Dao and his family came to Canada as Vietnamese refugees in 1979. With hard work and the support of their community in a small northern-BC town, they made the most of the opportunities Canada presented. The work ethic and perseverance his parents instilled in him early on remain a huge part of who he is and how he does business.</p><p>Dao is married to Sarah and has two daughters, Piper and Rory.</p><p><strong>Description</strong></p><p>This group perform some or all of the following duties:</p><p>Financial planners: Develop personal financial plans for clients covering cash management, finances, insurance coverage, investments, retirement and estate planning, taxes and legal matters.</p><p>Analyze clients’ financial records, set goals and develop a financial strategy.</p><p>Advise clients on implementing the financial plan to help them achieve their goals. May also arrange for the purchase and sale of financial products and investments depending on the licence held, and monitor the portfolio to ensure its quality and profitability.</p><p>May help to expand business and attract new clients.</p><p><strong>Job Forecast</strong></p><p>For Other financial officers, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 63,900 , while 60,700 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them. As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>This is what you typically need for the job: A bachelor’s degree in business administration, commerce, economics or a related field is usually required.</p><p>Various training programs and courses are offered by financial institutes and organizations, such as the Canadian Securities Institute, Institute of Canadian Bankers, Institute of Chartered Financial Analysts, Investment Funds Institute, Canadian Institute of Financial Planning, and Trust Companies Institute of Canada, and may be required by employers.</p><p>The designation Personal Financial Planner, awarded by the Financial Planners Standards Council of Canada, may be required.</p><p>Financial planners who sell regulated financial products and investments, such as annuities, RRSPs and life insurance, are required to be licensed by the appropriate governing body.</p><p>Financial examiners and inspectors may require a recognized accounting designation. Mortgage brokers require a real estate licence in Quebec and a mortgage broker licence in Newfoundland and Labrador, Nova Scotia, Ontario, Manitoba, Saskatchewan, Alberta and British Columbia.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_10_24_18_31_26_9715bd26-206f-4932-9dfd-fc34397d43bb.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "42",
    "wp_id": 749,
    "slug": "episode-042-recruiter-managing-director-talk-with-trevor-baker",
    "title": "42: Recruiter & Managing Director Talk with Trevor Baker",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221007_091022_f8d26f34b7823d7f3f8da7a3a289294e.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/10/Recruiter-Managing-Director-Talk-with-Trevor-Baker-the-job-talk-episode-042.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=hcu6EeMRK_0",
    "youtube_full": "https://www.youtube.com/watch?v=r3c3dcak5LA",
    "keywords": ["Managing Director", "Recruiter"],
    "published": 1665176547000,
    "time": "32:58",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-042-recruiter-managing-director-talk-with-trevor-baker/\">Recruiter & Managing Director Talk with Trevor Baker</a></strong></p><p>Trevor had the opportunity to grow up in multiple cities across Western Canada, giving him insight into the regional nuances and characteristics that make it unique.</p><p>He is a graduate of Western University, and holds additional accreditations from UBC, the ICF, and is currently enrolled in the Human Resources program at SFU with an eye to earning his CHRP designation.</p><p>Trevor’s pre-recruitment corporate career spanned 15-years with organizations such as Labatt, SC Johnson, and Roche Diagnostics in roles ranging from Sales Representative to Director.</p><p>Trevor complements his employment with volunteer work with a variety of organizations, both past and present. Some of these include Board positions with the Food Executives Club of Vancouver, the CAN Fishing for Kids Tournament, the Canadian Coast Guard Auxiliary, and others.</p><p>Trevor’s sense of humour, professionalism, and ability to connect with all candidates and clients alike, make him a valued resource in the community he serves.</p><p>Trevor’s recruitment focus is on mid to senior level Sales and Marketing roles for the Consumer Products and Life Sciences categories.</p><p>MacDonald Search Group has great resources for candidates. Reach out to request a Resume Creation or Interview Guide.</p><p><strong>Description</strong></p><p>Human resources managers plan, organize, direct, control and evaluate the operations of human resources and personnel departments, and develop and implement policies, programs and procedures regarding human resource planning, recruitment, collective bargaining, training and development, occupation classification and pay and benefit administration. They represent management and participate actively on various joint committees to maintain ongoing relations between management and employees. They are employed throughout the private and public sectors.</p><p><strong>Job Forecast</strong></p><p>For Human resources managers, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 15,000 , while 15,700 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>A bachelor’s degree in a field related to personnel management, such as business administration, industrial relations, commerce or psychology or Completion of a professional development program in personnel administration is required.</p><p>Several years of experience as a personnel officer or human resource specialist are required.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_10_07_21_01_39_bcc0777f-2064-47ea-9853-232385e2a4dd.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "41",
    "wp_id": 743,
    "slug": "episode-041-marketing-professional-talk-with-wendy-winder",
    "title": "41: Marketing Professional Talk with Wendy Winder",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20221007_011056_31e7232f13edb5755168c5bdc7fad3b0.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/10/Marketing-Professional-Talk-with-Wendy-Winder-the-job-talk-podcast-episode-041.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=V7KAKmsFcaQ",
    "youtube_full": "https://www.youtube.com/watch?v=PGZunNuVdrU",
    "keywords": ["Marketing"],
    "published": 1665174980000,
    "time": "25:59",
    "preview_description": "Wendy Winder is a senior marketing leader with 25+ years of experience in all aspects of marketing, brand management and strategic planning.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-041-marketing-professional-talk-with-wendy-winder/\">Marketing Professional Talk with Wendy Winder</a></strong></p><p>Wendy Winder is a senior marketing leader with 25+ years of experience in all aspects of marketing, brand management and strategic planning. From advertising, social media, event management and planning, promotions, direct marketing, public relations, sponsorships, loyalty marketing, media buying, category management, head office sales experience and everything in-between, Wendy has either done it or led a team in executing it. Her signature ‘let’s get it done’ attitude, creative vision and aptitude for building teams with a foundation of trust have served her and the wide variety of B2C and B2B companies she worked for with positive results.</p><p>Recently, Wendy launched her own strategy and marketing firm – Ray Strategic Marketing. Ray helps companies grow through business strategy, brand positioning, identifying their unique value proposition, marketing planning and assistance in execution. Wendy works with companies to get clarity on who they are, and where they want to go and helps put a road map together of how to get there. She then supports them in execution to achieve success.</p><p><strong>Description</strong></p><p>Advertising, marketing, public relations and e-business managers plan, organize, direct, control and evaluate the activities of establishments and departments involved in commercial, industrial and e-business advertising, marketing and public relations. They are employed by commercial and industrial establishments, government departments, and advertising, marketing and public relations firms or consulting businesses.</p><p><strong>Job Forecast</strong></p><p>The analysis of key labour market indicators such as job vacancies and employment growth as well as the unemployment rate suggests that the number of job seekers was sufficient to fill the job openings in this occupational group over the 2016-2018 period. For Advertising, marketing and public relations managers & Other business services managers, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 19,400 , while 19,900 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p><strong>Employment Requirements</strong></p><p>A university degree or college diploma in business administration or in a related field with a specialization in sales or marketing and Several years of experience as a sales, marketing or public relations representative or in a related occupation are required.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_10_07_01_04_09_fe5a85d4-0920-40f0-9ffc-a4113b2dc827.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "40",
    "wp_id": 734,
    "slug": "episode-040-alternative-energy-talk-with-brandon-sandmaier",
    "title": "40: Alternative Energy Talk with Brandon Sandmaier",
    "image": "https://media.rss.com/thejobtalk/ep_cover_20220921_110949_1d15ebcf4275fc52d3c9fa9ac3ced281.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/Alternative-Energy-Talk-with-Brandon-Sandmaier-The-Job-Talk-Podcast-Episode-040.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=rV_nKc2r7rQ",
    "youtube_full": "https://www.youtube.com/watch?v=PiU9F9bQH6U",
    "keywords": ["Alternative Energy"],
    "published": 1663802121000,
    "time": "28:15",
    "preview_description": "Brandon Sandmaier is currently the Municipal Energy Specialist for Sturgeon County. In his role, he is responsible for the energy management of County Operations.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-040-alternative-energy-talk-with-brandon-sandmaier/\">Alternative Energy Talk with Brandon Sandmaier</a></strong></p><p>Brandon Sandmaier is currently the Municipal Energy Specialist for Sturgeon County. In his role, he is responsible for the energy management of County Operations. This includes energy efficiency project development, managing renewable assets, GHG and energy monitoring, employee engagement, and annual energy reporting. Brandon Sandmaier has a background in developing clean technology projects in Alberta for residential and commercial applications. Prior to joining Sturgeon County, Brandon was Operations Manager for a solar design/build firm managing project design and field staff responsible for energy efficiency, and renewable energy projects. Brandon brings years of experience with project management and holds a Certified Energy Auditor (CEA) designation as well as a Diploma in Alternative Energy Technology from NAIT.</p><p><strong>Description</strong></p><p>Alternative energy technologists work with engineers, designers, and installers to design, plan, and manage the installation of alternative energy systems. These could include solar photovoltaic, solar thermal, geoexchange, wind, microhydro, co-generation, energy storage, or bioenergy systems.</p><p>This is an emerging occupation. It may have evolved from an existing occupation or emerged in response to consumer needs or technological advances.</p><p>Alternative energy is sometimes called renewable or sustainable energy. It is derived from natural sources, such as the earth, sun, wind, biomass, and water.</p><p>Alternative energy technologists assess proposed sites for alternative energy systems. They consider economic and environmental factors, and social responsibility. They:</p><ul><li><p>Calculate system needs based on energy demand</p></li><li><p>Design alternative energy systems</p></li><li><p>Conduct economic analyses and feasibility studies to determine ROI (return on investment)</p></li><li><p>Develop project charters and manage project plans</p></li><li><p>Perform quality assurance and quality control tests</p></li><li><p>Work with technicians, installers, and tradespeople</p></li><li><p>Troubleshoot technical problems related to energy generation, distribution, and storage</p></li><li><p>Develop and deliver presentations to potential clients and industry partners</p></li><li><p>Design energy management plans for corporations and municipalities</p></li></ul><p><strong> </strong></p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/2022_09_21_23_15_05_8e407343-82b7-485b-a6d9-805351041e13.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "39",
    "wp_id": 713,
    "slug": "episode-039-restauranteur-talk-with-theo-psalios",
    "title": "39: Restauranteur Talk with Theo Psalios",
    "image": "https://media.rss.com/thejobtalk/20220911_020908_dec3c4d1c18b3a5a39f9d3fcd7af5245.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/episode-039-restauranteur-talk-with-theo-psalios-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=lJfiuNDL-Co",
    "youtube_full": "https://www.youtube.com/watch?v=ivLuhy1Tyes",
    "keywords": ["restauranteur"],
    "published": 1662907868000,
    "time": "28:13",
    "preview_description": "Theo Psalios grew up learning from his father, famed Edmonton restaurateur Yianni Psalios and honed his craft during the early years at Koutouki.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-039-restauranteur-talk-with-theo-psalios/\">Restauranteur Talk with Theo Psalios</a></strong></p><p>Theo Psalios grew up learning from his father, famed Edmonton restaurateur Yianni Psalios and honed his craft during the early years at Koutouki. Now, with over 20 years of experience in Greek cuisine, Theo maintains his philosophy here at Little Village by building relationships with his customers through a spirit of Greek tradition in nurturing others with good food and care. In 2012 Theo hit the streets with one little food truck. Little Village has now expanded into a brick and mortar takeaway shop and a flourishing catering company. </p><p><strong>Description</strong></p><p>Restaurant owners oversee the day-to-day operations of a restaurant, managing staff, resolving customer issues and work to make the establishment profitable. Although no degree is required, restaurant owners typically have a wealth of experience in the business.</p><p>In managing their establishments, restaurant owners wear a lot of hats. Their overarching goal is to make sure that customers are satisfied with their food and that the restaurant turns a profit. That means overseeing the kitchen staff as they prepare, cook and present the meals, monitoring the wait staff as they serve customers and working with the cleaning staff to make sure everything is up to food and health safety standards.</p><p>Owners are also in charge of keeping track of inventory, doing payroll, managing the budget and making a schedule for the workers, though owners may choose to delegate some or all of these tasks to a manager.</p><p>If you want to become a restaurant owner, it helps tremendously to get some experience working in a restaurant first. Some owners start out at the bottom of the industry, washing dishes, serving tables or preparing meals. There, they learn the business and work their way up into management positions before running the show themselves.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series:</p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220911_020956_556385fe87dfc43a3388e8dd0906888c.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "38",
    "wp_id": 707,
    "slug": "episode-038-personal-fitness-trainer-talk-with-kelsey-vickers",
    "title": "38: Personal Fitness Trainer Talk with Kelsey Vickers",
    "image": "https://media.rss.com/thejobtalk/20220911_020928_0fb54ac808c28d6e9e81efce6973a56a.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/episode-038-personal-fitness-trainer-talk-with-kelsey-vickers-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=kefE0EYIu_o",
    "youtube_full": "https://www.youtube.com/watch?v=ccWVIcdG0vE",
    "keywords": ["fitness", "trainer"],
    "published": 1662906688000,
    "time": "23:56",
    "preview_description": "Kelsey Vickers is a certified personal trainer, nutrition coach, group exercise instructor, business owner of Alberta Fitness and co-owner of the girls wellness program, Fit + Fierce.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-038-personal-fitness-trainer-talk-with-kelsey-vickers/\">Personal Fitness Trainer Talk with Kelsey Vickers</a></strong></p><p>Kelsey Vickers is a certified personal trainer, nutrition coach, group exercise instructor, business owner of Alberta Fitness and co-owner of the girls wellness program, Fit + Fierce. Her passion is helping people build healthy habits with food and exercise to promote a healthy balanced lifestyle. Her goal is to help people believe in themselves and see what they are capable of achieving. She understands that every BODY is different and it’s important to her that everyone defines what strong means to them! </p><p><strong>Description</strong></p><p>Program leaders and instructors in recreation, sport and fitness lead and instruct groups and individuals in recreational, sports, fitness or athletic programs. They are employed by community centres, sports and fitness clubs, outdoor centres, resorts, recreational facilities, health care facilities, retirement homes, correctional institutions, government departments, private businesses, tourism associations and similar establishments.</p><p><strong>Job Forecast</strong></p><p>In order to determine the expected outlook of an occupation, the magnitude of the difference between the projected total numbers of new job seekers and job openings over the whole projection period (2019-2028) is analyzed in conjunction with an assessment of labour market conditions in recent years. The intention is to determine if recent labour market conditions (surplus, balance or shortage) are expected to persist or change over the period 2019-2028. For instance, if the analysis of key labour market indicators suggests that the number of job seekers was insufficient to fill the job openings (a shortage of workers) in an occupational group in recent years, the projections are used to assess if this situation will continue over the projection period or if the occupation will move towards balanced conditions.</p><p>The analysis of key labour market indicators such as job vacancies and employment growth as well as the unemployment rate suggests that the number of job seekers was sufficient to fill the job openings in this occupational group over the 2016-2018 period.</p><p>For Athletes, coaches, referees and related occupations, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 37,200 , while 39,700 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them. As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>Completion of secondary school is usually required.</p><p>Completion of a college program in recreation or physical education or extensive experience in a specific recreational or sports program activity is usually required. Certification is usually required in a specific area of recreational, sports or fitness activity, such as ski instructor or personal trainer, or in first aid or emergency care. Demonstrated ability in a particular recreational, sports or fitness discipline is required.</p><p>Fitness appraiser certification may be required for fitness appraisers.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series:</p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220911_020917_7b84e258994d9d42978629c9aede2c07.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "37",
    "wp_id": 701,
    "slug": "episode-037-leadership-career-coach-talk-with-jennifer-kirkelund",
    "title": "37: Leadership & Career Coach Talk with Jennifer Kirkelund",
    "image": "https://media.rss.com/thejobtalk/20220911_020912_915a5d5c575b3b473f3d8910fec2ca4e.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/episode-037-leadership-career-coach-talk-with-jennifer-kirkelund-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=uOlDw4XimEY",
    "youtube_full": "https://www.youtube.com/watch?v=BY32AvNPV1A",
    "keywords": ["career coach", "leadership"],
    "published": 1662907515000,
    "time": "35:42",
    "preview_description": "Jennifer Kirkelund is passionate about coaching professionals to achieve success in all aspects of their lives.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-037-leadership-career-coach-talk-with-jennifer-kirkelund/\">Leadership & Career Coach Talk with Jennifer Kirkelund</a></strong></p><p>Jennifer Kirkelund is passionate about coaching professionals to achieve success in all aspects of their lives. The purpose of her work is to assist clients to build resilience through personal growth and development. With the application of a solution-focused coaching process, Jennifer challenges and empowers individuals to identify values, strengths, and abilities. Through the application of innovative thinking and critical analysis, clients clarify goals and create strategic action plans. She provides attention to awareness and confidence to increase self-efficacy in individuals.</p><p>Employment in various levels of Government has included constituency, legislative, minister’s offices and departments. Jennifer has enjoyed working creatively and collaboratively with professionals, providing guidance and support to corporate leaders. The purpose of her work is to help individuals develop career resilience through personal growth and development. Jennifer provides leadership coaching, professional development, performance excellence and effective conversations.</p><p><strong>Description</strong></p><p>Employment counsellors provide assistance and information to job seeker clients on all aspects of employment search and career planning. They also provide advice and information to employer clients regarding employment issues and human resources. They are employed by human resource departments of establishments, employment service organizations, consulting firms, correctional facilities and by federal and provincial governments. Supervisors of employment counsellors are included in this unit group.</p><p><strong>Job Forecast</strong></p><p>In order to determine the expected outlook of an occupation, the magnitude of the difference between the projected total numbers of new job seekers and job openings over the whole projection period (2019-2028) is analyzed in conjunction with an assessment of labour market conditions in recent years. The intention is to determine if recent labour market conditions (surplus, balance or shortage) are expected to persist or change over the period 2019-2028. For instance, if the analysis of key labour market indicators suggests that the number of job seekers was insufficient to fill the job openings (a shortage of workers) in an occupational group in recent years, the projections are used to assess if this situation will continue over the projection period or if the occupation will move towards balanced conditions. The analysis of key labour market indicators such as job vacancies and employment growth as well as the unemployment rate suggests that the number of job seekers was sufficient to fill the job openings in this occupational group over the 2016-2018 period.</p><p><strong>Employment Requirements</strong></p><p>A bachelor’s degree or college diploma in employment counselling, career development or in a related field, such as human resources development, psychology, education or social services is required. A master’s degree in counselling psychology or a related field such as educational psychology, developmental psychology or social work may be required. In Quebec, membership in a professional association is mandatory to use the title ”counsellor”.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series:</p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220911_020952_7c923e4fee0841f79c6b73a373c426b2.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "36",
    "wp_id": 693,
    "slug": "episode-036-producer-director-talk-with-ryan-northcott",
    "title": "36: Producer & Director Talk with Ryan Northcott",
    "image": "https://media.rss.com/thejobtalk/20220910_050942_964734cbc9db6a7cae671f753b168f26.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/episode-036-producer-director-talk-with-ryan-northcott-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=1GyX6fV5pOs",
    "youtube_full": "https://www.youtube.com/watch?v=76_R3E84DZY",
    "keywords": ["Director", "Producer"],
    "published": 1662831522000,
    "time": "38:00",
    "preview_description": "Panoramic Media was founded by Ryan Northcott, award-winning producer and director born and raised in Edmonton, Alberta.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-036-producer-director-talk-with-ryan-northcott/\">Producer & Director Talk with Ryan Northcott</a></strong></p><p>Panoramic Media was founded by Ryan Northcott, award-winning producer and director born and raised in Edmonton, Alberta. With over eight years experience in the production industry, Ryan has amassed dozens of screen credits, hundreds of hours of produced content, and a few awards and recognitions along the way.</p><p>So in 2020, Panoramic was born – a full service production agency based here in Alberta. As Ryan continues to produce high quality commercial, documentary and narrative content under this new brand, his long-term vision is to produce stories with heart and unique perspectives while helping put Alberta on the map for high-end film and digital content creation.</p><p><strong>Description</strong></p><p>Producers, directors, choreographers and professionals in related occupations oversee and control the technical and artistic aspects of film, television, video game, radio, dance and theatre productions. They are employed by film production companies, radio and television stations, video game companies, broadcast departments, advertising companies, sound recording studios, record production companies and dance companies. They may also be self-employed.</p><p><strong>Job Forecast</strong></p><p>In order to determine the expected outlook of an occupation, the magnitude of the difference between the projected total numbers of new job seekers and job openings over the whole projection period (2019-2028) is analyzed in conjunction with an assessment of labour market conditions in recent years. The intention is to determine if recent labour market conditions (surplus, balance or shortage) are expected to persist or change over the period 2019-2028. For instance, if the analysis of key labour market indicators suggests that the number of job seekers was insufficient to fill the job openings (a shortage of workers) in an occupational group in recent years, the projections are used to assess if this situation will continue over the projection period or if the occupation will move towards balanced conditions.</p><p>Over the 2016-2018 period, employment in this occupational group grew strongly. The unemployment rate increased slightly to reach 4.1% in 2018, below the national average of 5.8%. However, the unemployment rate for this occupation has been historically below the average of all occupations, mainly because about 60% of the workers are self-employed. The increase in the number of unemployed workers, coupled with a low and stable number of job openings, led to a surge in the number of available workers to fill those vacancies. The mixed signals of key labour market indicators suggests that the number of job seekers was sufficient to fill the job openings in this occupational group.</p><p>For Producers, directors, choreographers and related occupations & Conductors, composers and arrangers, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 11,300 , while 11,500 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p><strong>Employment Requirements</strong></p><p>A university degree or college diploma in the performing arts, broadcasting, journalism, business administration, theatre production or film studies and Experience in a technical or production occupation in motion pictures, broadcasting or theatre are usually required.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220910_050929_f1c80aa85cbadd9bb929005f5544311e.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "35",
    "wp_id": 687,
    "slug": "episode-035-director-of-sales-talk-with-scott-sulz",
    "title": "35: Director of Sales Talk with Scott Sulz",
    "image": "https://media.rss.com/thejobtalk/20220910_040908_78a582a390b3023b87faddc09caf2cad.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/episode-034-director-of-sales-talk-with-scott-sulz-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=nCYhR9vfgzE",
    "youtube_full": "https://www.youtube.com/watch?v=SD8GRXLeGLI",
    "keywords": ["sales"],
    "published": 1662826207000,
    "time": "33:09",
    "preview_description": "Scott Sulz has been connecting people with delicious natural food across Canada for 23 years in the natural food industry in Canada.",
    "description": "<p><strong>Director of Sales Talk with Scott Sulz</strong></p><p>Connecting people with delicious natural food across Canada is Scott Sulz’s passion. He’s dedicated 23 years to the natural food industry in Canada. He worked 3 years in grocery retail and 18 years as a distributor salesperson. Then in the middle of a pandemic, in 2021, Scott decided to make the leap from distribution (selling many items) to working for one company. Bringing passion and a coach mentality to selling delicious dark chocolate, Scott is on a journey to connect more and more people with “the best dark chocolate” he’s ever had.</p><p><strong>Description</strong></p><p>Advertising, marketing, public relations and e-business managers plan, organize, direct, control and evaluate the activities of establishments and departments involved in commercial, industrial and e-business advertising, marketing and public relations. They are employed by commercial and industrial establishments, government departments, and advertising, marketing and public relations firms or consulting businesses.</p><p><strong>Job Forecast</strong></p><p>For Advertising, marketing and public relations managers & Other business services managers, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 19,400 , while 19,900 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p><strong>Employment Requirements</strong></p><p>A university degree or college diploma in business administration or in a related field with a specialization in sales or marketing and several years of experience as a sales, marketing or public relations representative or in a related occupation are required.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series:</p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220910_040955_fa30d815d8de68812cee3a8a810e8905.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "34",
    "wp_id": 678,
    "slug": "episode-034-performer-producer-talk-with-rik-leaf",
    "title": "34: Performer & Producer Talk with Rik Leaf",
    "image": "https://media.rss.com/thejobtalk/20220910_030952_52a3426771da7403bdfd6abd0849775e.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/episode-034-performer-producer-talk-with-rik-leaf-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=G98thIioABo",
    "youtube_full": "https://www.youtube.com/watch?v=hDsewMlg8uc",
    "published": 1662825172000,
    "time": "49:23",
    "preview_description": "Rik Leaf is an arts in education specialist who has presented at the Northwest Territories Teachers Conference, Greater Edmonton Teachers Convention Association and numerous schools and districts across Canada.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-034-performer-producer-talk-with-rik-leaf/\">Performer & Producer Talk with Rik Leaf</a></strong></p><p>Rik Leaf is an arts in education specialist who has presented at the Northwest Territories Teachers Conference, Greater Edmonton Teachers Convention Association and numerous schools and districts across Canada. Rik is the Poet Laureate for Tribe of One, a national collective of Indigenous & settler musicians, dancers, painters & slam poets. Tribe of One’s multicultural performance workshops have taken them around the world partnering with the Foreign Affairs Department of Canada, the United Nations, War Child Canada and U.N.E.S.C.O.</p><p><strong>Description</strong></p><p>Producers, directors, choreographers and professionals in related occupations oversee and control the technical and artistic aspects of film, television, video game, radio, dance and theatre productions. They are employed by film production companies, radio and television stations, video game companies, broadcast departments, advertising companies, sound recording studios, record production companies and dance companies. They may also be self-employed.</p><p><strong>Job Forecast</strong></p><p>For Producers, directors, choreographers and related occupations & Conductors, composers and arrangers, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 11,300 , while 11,500 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p><strong>Employment Requirements</strong></p><p>Producers, directors and film editors A university degree or college diploma in the performing arts, broadcasting, journalism, business administration, theatre production or film studies and Experience in a technical or production occupation in motion pictures, broadcasting or theatre are usually required.</p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220910_030933_17dea319762e70d14082d3d0369d38e4.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "33",
    "wp_id": 668,
    "slug": "veterinarian-talk-with-dr-heather-gunn-mcquillan",
    "title": "33: Veterinarian Talk with Dr. Heather Gunn McQuillan",
    "image": "https://media.rss.com/thejobtalk/20220908_060921_8d57dc60bb3275a379dacfeada9ade09.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/09/Episode-033-Veterinarian-Talk-with-Dr.-Heather-Gunn-McQuillan.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=6uLCsV6I0AI",
    "youtube_full": "https://www.youtube.com/watch?v=3UMS0xo7B5o",
    "published": 1662661401000,
    "time": "24:24",
    "preview_description": "Dr. Gunn McQuillan focuses on delivering professional competencies in communication, conflict resolution, resiliency, leadership, wellness, diversity and inclusion, and veterinary business management.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/veterinarian-talk-with-dr-heather-gunn-mcquillan/\">Veterinarian Talk with Dr. Heather Gunn McQuillan</a></strong></p><p>Dr. Heather Gunn McQuillan has served as the Assistant Dean of Clinical and Professional Programming at the Atlantic Veterinary College (AVC) since August 2020. Prior to that time, she was the Hospital Director for the Veterinary Teaching Hospital (VTH) at AVC for nearly six years.</p><p>With more than fifteen years of practical experience in a diverse range of settings including companion animal medicine and surgery, large animal medicine (both health management and field service), emergency medicine, shelter medicine, remote outreach medicine in Canada’s North, and research/teaching in both academia and industry, Heather has brought this experience to overseeing and teaching in the Professional Foundations curriculum at AVC. Within that program, Dr. Gunn McQuillan focuses on delivering professional competencies in communication, conflict resolution, resiliency, leadership, wellness, diversity and inclusion, and veterinary business management.</p><p>Passionate about veterinary wellness, Heather is a Registered Yoga Teacher (RYT-200 and RYT-500 in-progress), a meditation instructor, and a certified MBSR (mindfulness-based stress reduction) facilitator. She holds a graduate certificate in Mindfulness-Based Teaching and Learning (MBTL) for adult education and is in the process of obtaining her Master’s in Education. She teaches regular mindfulness courses to AVC students and has integrated mindfulness teaching into the core curriculum through the professional foundations coursework.</p><p>She lives in beautiful Prince Edward Island, Canada with her partner, Jarrod and their two kids, Finlay and Emma.</p><p><strong>Description</strong></p><p>Veterinarians prevent, diagnose and treat diseases and disorders in animals and advise clients on the feeding, hygiene, housing and general care of animals. They work in private practice or may be employed by animal clinics, farms, laboratories, government or industry.</p><p><strong>Job Forecast</strong></p><p>For Veterinarians, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 3,600 , while 3,900 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them. As it was the case over the last decade, population growth should lead to an increase in the number of household pet owners. Improvement in the health services offered to pets and access to different pet insurance products are also expected to continue fueling the demand for veterinarian services. In addition, the ongoing reinforcement of animal food quality inspections and of livestock exports and imports should also contribute to employment growth in this occupational group.</p><p><strong>Employment Requirements</strong></p><p>This is what you typically need for the job: Two years of pre-veterinary university studies or completion of a college program in health science and a four to five year university degree in veterinary medicine and Completion of national certification examinations are required. A provincial licence to practice is required. Entry into research positions may require post-graduate study.</p><p><strong>Salary</strong></p><p>Job Bank Link: <a href=\"https://www.jobbank.gc.ca/marketreport/summary-occupation/4127/ca\">https://www.jobbank.gc.ca/marketreport/summary-occupation/4127/ca</a></p><p><strong>Need More?</strong></p><p>Check out our Career Crisis Interview Series: </p><p><a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220908_060918_8bda88fc7f05c3f29aea4b233dea85d3.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "32",
    "wp_id": 655,
    "slug": "radio-broadcaster-talk-with-jason-gregor",
    "title": "32: Radio Broadcaster Talk with Jason Gregor",
    "image": "https://media.rss.com/thejobtalk/20220810_100836_124709efa5a826b3c3acbeb61aab991d.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/08/Radio-Broadcaster-Talk-with-Jason-Gregor-episode-032-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=obN63bp-A2U",
    "youtube_full": "https://www.youtube.com/watch?v=fYIgdTzi3_M",
    "keywords": ["Radio Broadcaster"],
    "published": 1660170216000,
    "time": "35:42",
    "preview_description": "Jason Gregor is a sports talk radio host on TSN 1260 in Edmonton weekdays from 2-6 p.m, and he joins us to discuss Radio Broadcasting!",
    "description": "<p><strong><a href=\"https://thejobtalk.com/radio-broadcaster-talk-with-jason-gregor/\">Radio Broadcaster Talk with Jason Gregor</a></strong></p><p>Jason Gregor is a sports talk radio host on TSN 1260 in Edmonton weekdays from 2-6 p.m. He began his radio career in 2001 after graduating with honours from NAIT’s Radio and Television Arts program, and he has hosted his own sports talk show since 2003. In 2005, he started his own broadcasting company, Just A Game Productions, and he operates every aspect of his show: on-air, sales, marketing and promotions.</p><p>In addition to his daily talk show he is the lead columnist on OilersNation. Besides being an avid sports enthusiast, Jason is very passionate about philanthropy and community involvement. Over the past eight years he has raised over $2 million on his radio show for charities including, The MS Bike Tour, Santas Anonymous, The Christmas Bureau, Alzheimer’s Faceoff, Operation Friendship Seniors Society, Adopt-A-Teen and many more.</p><p>He founded The Gregor Foundation in 2014. The Foundation provides high school boys, who can’t afford it, a brand new suit, shirt, ties and shoes for their graduation.</p><p>Jason was named a Paul Harris Fellow by Rotary International in 2014 and was named one of Edmonton’s Top 40 under 40 in 2011. He was listed as Edmonton’s favorite sports host by Vue Magazine in 2011-2019 and he was the reader’s choice for top radio talk show host in the Edmonton Journal in 2014-2018. Jason currently resides in St.Albert with his wife and son.</p><p><strong>Description</strong></p><p>Announcers and other broadcasters read news, sports, weather, commercial and public service messages and host entertainment and information programs for broadcast on radio or television. They are primarily employed by radio and television stations and networks and by commercial firms that produce advertisements for radio or television.</p><p><strong>Job Forecast</strong></p><p>For Announcers and other performers, n.e.c., over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 4,000 , while 4,600 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>Completion of a college radio or television arts program is usually required. Practical training, such as work at a college radio station, may be required.</p><p>Talent and ability, as demonstrated during an audition, are important hiring criteria.</p><p>Membership in a guild or union related to the occupation or type of performance may be required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220810_100823_44884df4e9c0fb4d4a93f859ea6b51f3.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "31",
    "wp_id": 647,
    "slug": "episode-031-sr-academic-administrator-talk-with-chris-lonsdale",
    "title": "31: Sr. Academic Administrator Talk with Chris Lonsdale",
    "image": "https://media.rss.com/thejobtalk/20220810_100800_e387320d1470a295dc4316892b03242a.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/08/Sr.-Academic-Administrator-Talk-with-Chris-Lonsdale-Episode-031-the-job-talk-podcast-1.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=egQu27DVIqM",
    "youtube_full": "https://www.youtube.com/watch?v=xZsamqCMFo8",
    "keywords": ["Academic Administrator"],
    "published": 1660169400000,
    "time": "27:35",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-031-sr-academic-administrator-talk-with-chris-lonsdale/\">Sr. Academic Administrator Talk with Chris Lonsdale</a></strong></p><p>Professor Chris Lonsdale is the Deputy Provost of Australian Catholic University. He has a multi-disciplinary background in psychology, education, public health, and sport science which informs his research and enterprise activities focused on promoting children and adolescent’s wellbeing and learning. Leading a team of researchers and students from across ACU, Professor Lonsdale’s iPLAY program recently won the 2021 Vice-Chancellor’s award for excellence in research and research partnership. He has a strong track record of research funding from the National Health and Medical Research Council and the Australian Research Council, as well as long-standing partnerships with government and non-profit agencies in the health and education sectors. As Deputy Provost, Professor Lonsdale leads a broad suite of initiatives, including Academic Promotions, Workforce Profile and the Student Success Program.</p><p><strong>Description</strong></p><p>Administrators in post-secondary education and vocational training include faculty administrators and registrars of colleges or universities and administrators of vocational training schools. Faculty administrators manage the academic and related activities of faculties of colleges or universities. Registrars manage registration activities and academic records systems of colleges or universities. Administrators of vocational training schools manage the operations of vocational schools specializing in trades, technology, business or other vocational subjects.</p><p><strong>Job Forecast</strong></p><p>For Administrators – post-secondary education and vocational training, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 6,800, while 7,200 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>Faculty administrators require a graduate degree in a field related to the academic faculty and Several years of experience as a university professor or college teacher.</p><p>Registrars require an undergraduate degree in business administration or a related field and Several years of experience in registration administration.</p><p>Administrators of vocational training schools usually require an undergraduate degree in business administration or Expertise and certification in a subject of instruction.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220810_100848_c71a19ac1e38837fcbeccf44e67f8fe2.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "30",
    "wp_id": 640,
    "slug": "forest-health-supervisor-talk-with-aaron-mcgill",
    "title": "30: Forest Health Supervisor Talk with Aaron McGill",
    "image": "https://media.rss.com/thejobtalk/20220810_090838_52873155bc76e39caf2545f4732cb6b1.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/08/Forest-Health-Supervisor-Talk-with-Aaron-McGill-Episode-030-The-Job-Talk-Podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=wH3U8Ywa28o",
    "youtube_full": "https://www.youtube.com/watch?v=D4YcUZjKCpk",
    "published": 1660168598000,
    "time": "28:26",
    "description": "<p><strong><a href=\"https://thejobtalk.com/forest-health-supervisor-talk-with-aaron-mcgill/\">Forest Health Supervisor Talk with Aaron McGill</a></strong></p><p>Aaron McGill is the forest health supervisor for the province of Nova Scotia and has over 30 years of experience in the forest industry. He has worked in four provinces in forestry consulting, industry, provincial governments and also environmental engineering and is always looking for efficiencies and ways to improve processes. The forest industry offers growth through diverse career pathways and has provided the opportunity to experience remote locations across the country.</p><p><strong>Description</strong></p><p>Supervisors in logging and forestry supervise and co-ordinate the activities of workers engaged in logging operations and silvicultural operations. They are employed by logging companies, contractors and government agencies.</p><p><strong>Job Forecast</strong></p><p>For Supervisors, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 1,000 , while 900 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them. As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>Completion of secondary school is usually required.</p><p>Completion of a one- to three-year college program for forestry technologists or technicians may be required.</p><p>Formal company training and several months of on-the-job training are provided. Several years of experience as a logger, silvicultural worker, or logging machinery operator are usually required.</p><p>A chemical application licence may be required.</p><p>An industrial first aid certificate may be required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220810_090826_462e8662aa82b38d9f68a0a247651936.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "29",
    "wp_id": 632,
    "slug": "episode-029-junior-high-school-teacher-talk-with-peter-medina",
    "title": "29: Junior High School Teacher Talk with Peter Medina",
    "image": "https://media.rss.com/thejobtalk/20220810_090850_6e4095c2ad137be94b9f46f5a7fedd2b.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/08/Junior-High-School-Teacher-Talk-with-Peter-Medina-Episode-029-The-Job-Talk-Podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=yrrvO1AIom8",
    "youtube_full": "https://www.youtube.com/watch?v=7fSTxbMEi7c",
    "published": 1660167170000,
    "time": "29:31",
    "preview_description": "Peter Medina is currently a Junior High Teacher for the Edmonton Catholic School District and he joins us on the Job Talk Podcast!",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-029-junior-high-school-teacher-talk-with-peter-medina/\">Junior High School Teacher Talk with Peter Medina</a></strong></p><p>Peter Medina is currently a Junior High Teacher for the Edmonton Catholic School District. He is entering his 19th year of teaching in the 2022-23 school year. Peter also spent his first three years of teaching with the Calgary Catholic School District where he taught combined Grade 5/6 classes. A major highlight of his job includes leading teens to discover social justice issues in Edmonton and the organizations that are trying to help people facing these issues. Some organizations Peter and his school have worked with are: United Way’s Tools for School, Autism Edmonton, and Warm Hands Warm Hearts. Peter graduated with a Bachelor of Science degree in Biology from Concordia University of Edmonton in 2001. Afterwards, he followed up with a 2-year Bachelor of Education (After Degree) from the University of Alberta. In 2004, Peter was nominated for the Edwin Parr Teacher Award which is awarded to first-year teachers who have displayed outstanding skills and performance during their initial year of teaching. Outside of work, Peter can be found being active in the local fitness community, parenting 2 young boys alongside his wife Kaila (an elementary school teacher), and cheering on the Edmonton Oilers.</p><p><strong>Description</strong></p><p>Secondary school teachers prepare and teach academic, technical, vocational or specialized subjects at public and private secondary schools. Secondary school teachers who are heads of departments are included in this unit group.</p><p><strong>Job Forecast</strong></p><p>Over the 2016-2018 period, labour market conditions have not changed significantly for this occupational group. Employment declined slightly, which was reflected in a small increase in the unemployment rate, reaching 5.2% in 2018. On the other hand, the number of job vacancies increased mildly, but only in 2018. As a result, the number of unemployed available to fill those vacant positions remained relatively stable over the past three years. Nevertheless, the jobless rate remained below the national average of 5.8%.</p><p><strong>Employment Requirements</strong></p><p>Teachers of academic subjects require a bachelor’s degree in education which is often preceded by a bachelor’s degree in the arts or sciences.</p><p>Teachers of vocational or technical subjects require a bachelor’s degree in education which is usually preceded by specialized training or experience in the subject.</p><p>Instructors of trades in Quebec require completion of an apprenticeship training program and industry or trade certification.</p><p>Department heads usually require several years of teaching experience.</p><p>To specialize in special education or English or French as a second language, additional training is required.</p><p>A provincial teaching certificate is required.</p><p>Membership in a provincial or territorial teachers’ association or federation may be required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220810_090838_4d79f1f77caa8eb630761be8e336ce9e.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "28",
    "wp_id": 622,
    "slug": "episode-028-elementary-school-teacher-talk-with-kaila-medina",
    "title": "28: Elementary School Teacher Talk with Kaila Medina",
    "image": "https://media.rss.com/thejobtalk/20220810_040819_aa3018a4f1e20f74ab3be2169fe5f36c.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/08/Elementary-School-Teacher-Talk-with-Kaila-Medina-Episode-028-the-job-talk-podcasty.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=vWqh2eSf8WM",
    "youtube_full": "https://www.youtube.com/watch?v=foEv7-LAzOc",
    "keywords": ["School Teacher"],
    "published": 1660148838000,
    "time": "23:47",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-028-elementary-school-teacher-talk-with-kaila-medina/\">Talk with Kaila Medina</a></strong></p><p>Kaila Medina is currently a Grade 3 Teacher for the Edmonton Catholic School District. Kaila has wanted to be a teacher since she was in grade two. Currently, she has been teaching for 11 years and is enjoying (mostly) every minute! Kaila graduated with a Bachelor of Education in 2009 from the University of Alberta. Most of Kaila’s career has been in lower elementary. She has taught regular classes, double classes and online classes. She loves using her creativity and tech skills to create educational resources for herself and other teachers. In 2019, Kaila and her best friend Kristi (also a teacher) wanted to combine their love of teaching and social media. They created their first teacher Instagram page, @teachers.tea and have since grown a community of teacher followers. Kaila and Kristi share resources they have made for free with their followers, post teaching ideas and inspiration and some pretty (in our opinion) funny Instagram reels! For the past two years, they have reached out to local small businesses for donations and hosted a Teacher Appreciation Giveaway during Teacher Appreciation Week with amazing success. Outside of work, Kaila loves to walk, enjoy Edmonton’s food scene with her besties and spend time with her two boys Xavier (4) and Mason (2) and of course her husband of 7 years, Peter.</p><p><strong>Description</strong></p><p>Elementary school and kindergarten teachers teach basic subjects such as reading, writing and arithmetic or specialized subjects such as English or French as a second language at public and private elementary schools.</p><p><strong>Job Forecast</strong></p><p>Labour demand and labour supply are expected to be broadly in line for this occupation group over the 2019-2028 period at the national level. The section below contains more detailed information regarding the outlook for this occupational group.</p><p><strong>Employment Requirements</strong></p><p>A bachelor’s degree in education is required.</p><p>A bachelor’s degree in child development may be required.</p><p>Additional training is required to specialize in special education or second language instruction.</p><p>A provincial teaching certificate is required. Additional certification is required to teach English or French as a second language.</p><p>Membership in a provincial or territorial teachers’ association or federation is usually required.</p><p><strong>Salary Range</strong></p><p>Job Bank Link: <a href=\"https://www.jobbank.gc.ca/marketreport/summary-occupation/6176/ca\">https://www.jobbank.gc.ca/marketreport/summary-occupation/6176/ca</a></p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220810_040807_97c04249846ae4375c7c1e449054918c.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "27",
    "wp_id": 495,
    "slug": "episode-027-realtor-talk-with-robbie-kamaleddine",
    "title": "27: Realtor Talk with Robbie Kamaleddine",
    "image": "https://media.rss.com/thejobtalk/20220717_090745_6d1b8b569d034712e185c28a5be2ff14.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/Realtor-Talk-with-Robbie-Kamaleddine-The-Job-Talk-Podcast-Episode-027.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=vaGY2paBpSM",
    "youtube_full": "https://www.youtube.com/watch?v=6EYDEy3THT0",
    "published": 1658093445000,
    "time": "38:07",
    "preview_description": "Robbie Kamaleddine is recognized as an industry innovator and takes pride in delivering a luxury real estate experience at all price points.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-027-realtor-talk-with-robbie-kamaleddine/\">Realtor Talk with Robbie Kamaleddine</a></strong></p><p>Robbie Kamaleddine (pronounced ‘Camel-deen’) is recognized as an industry innovator and takes pride in delivering a luxury real estate experience at all price points. After a decade in luxury fashion, he launched his real estate career in late 2017. By 2018, Robbie took home Remax’s prestigious Rookie of the Year Award.</p><p>Edmonton has been home to Robbie since emigrating with his family from Lebanon in 2002. He completed his Bachelor of Science degree at the University of Alberta during which he was also heavily involved in the drama department.</p><p>Since graduating he has continued his association with Edmonton’s arts community and is a frequent theater goer and avid Fringer. The central tenet of Robbie’s approach to life, both professionally and at home, is a strong conviction about having a positive impact on everyone he meets. He passionately believes that the real estate experience should be dynamic and fun.</p><p>Robbie is a horrible dancer.</p><p><strong>Description</strong></p><p>Real estate agents and salespersons act as agents for the sale or purchase of houses, apartments, commercial buildings, land and other real estate. They are employed in the real estate industry.</p><p><strong>Job Forecast</strong></p><p>For Real estate agents and salespersons, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 58,300 , while 58,900 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them.</p><p><strong>Employment Requirements</strong></p><p>Completion of secondary school is required.</p><p>Completion of a real estate training course is required.</p><p>Provincial or territorial licensure in the province or territory of employment is required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220717_090732_16e9a2252a0018960042fe9d37b76296.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "26",
    "wp_id": 487,
    "slug": "fine-jewellery-designer-talk-with-sonja-deklerk",
    "title": "26: Fine Jewellery Designer Talk with Sonja Deklerk",
    "image": "https://media.rss.com/thejobtalk/20220717_090720_1808de151688a7694c0fe510711815b4.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/Fine-Jewellery-Designer-Talk-with-Sonja-Deklerk-The-Job-Talk-Podcast-Episode-026.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=PC7WoX7eKKc",
    "youtube_full": "https://www.youtube.com/watch?v=8ds3NGflahg",
    "published": 1658092400000,
    "time": "46:16",
    "preview_description": "Sonja Deklerk is the owner of a bespoke jewellery design studio in Edmonton Alberta and offers a curated collection of vintage fine jewellery.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/fine-jewellery-designer-talk-with-sonja-deklerk/\">Fine Jewellery Designer Talk with Sonja Deklerk</a></strong></p><p>Sonja Deklerk is the owner of a bespoke jewellery design studio in Edmonton Alberta and offers a curated collection of vintage fine jewellery. After studying Fine Art at MacEwan University, Sonja began her career in fine jewellery design working as an in-house designer for Adamas Goldsmiths and then Vandenbergs Jewellers. With over 22 years experience in the fine jewellery industry, Sonja is passionate about creating fine jewellery as uniquely beautiful as the individual for whom it is intended.</p><p>Sonja completed the Applied Jewellery Programme through the Gemological Institute of America and is currently studying to become a Graduate Gemologist.</p><p>Sonja is currently a member of the Canadian Jewellery Association and serves on the board of directors at the Leduc Arts Foundry. In addition to this, Sonja is the host of the podcast “More Than Gold” a podcast that navigates the joys and sorrows of this world while rejoicing in three very important truths:</p><p>You are precious</p><p>You are of value</p><p>You are worth more than gold</p><p><strong>Description</strong></p><p>Jewellery designers design and make jewellery using a variety of materials, including gold, silver and precious stones. You could either produce designs for mass production, make jewellery in small numbers or create bespoke pieces commissioned by a client. If you work for a company, it is likely that other members of staff will make your designs.</p><p><strong>Job Forecast</strong></p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labor supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>You don’t need a degree or HND to be a jewellery designer – proven craft skills are more important – but those without a higher education qualification would usually need to undertake an apprenticeship or on-the-job training.</p><p><strong>Salary Range</strong></p><p>Salaries vary widely according to whether you’re employed or self-employed, how experienced, successful and well-established you are, and how actively and skilfully you promote your jewellery or business. It’s possible to earn high salaries, but this can be difficult in the early part of your career and an additional income may be needed.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220717_090707_334e68638fc7757e0a86e0b7658b9708.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "25",
    "wp_id": 481,
    "slug": "episode-025-industrial-designer-talk-with-brendan-gallagher",
    "title": "25: Industrial Designer Talk with Brendan Gallagher",
    "image": "https://media.rss.com/thejobtalk/20220717_080704_bc242cf2574da4177fd3d4f19ad2cdd2.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/Industrial-Designer-Talk-with-Brendan-Gallagher-The-Job-Talk-Podcast-Episode-025.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=Pnp1tjP0kqU",
    "youtube_full": "https://www.youtube.com/watch?v=wxUIfy0LDn8",
    "published": 1658091483000,
    "time": "27:42",
    "preview_description": "Brendan Gallagher is one of the creators and founders of Onetwosix Design Inc, an Edmonton based Industrial Design Agency.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-025-industrial-designer-talk-with-brendan-gallagher/\">Industrial Designer Talk with Brendan Gallagher</a></strong></p><p>Brendan Gallagher is one of the creators and founders of Onetwosix Design Inc, an Edmonton based Industrial Design Agency with fellow University of Alberta Industrial Design graduate Nick Kazakoff. The goal of Onetwosix was to provide world class product design services in the city of Edmonton while creating products that improve the human experience. In 2015, the duo elevated the world of office furniture by launching Loop Phone Booths. Over the last seven years, they have scaled the company to include a full manufacturing facility in Edmonton as they worked with clients ranging from Lockheed Martin to Pokémon to Google X.</p><p>After graduating from the Industrial Design program at the University of Alberta in 2012 and prior to co-founding Onetwosix, Brendan specialized in digital manufacturing and design for 3D printing. His expertise in additive manufacturing led to early career opportunities at the University of Alberta, as well as the Institute of Reconstructive Science in Medicine where he specialized in using 3D printing and digital surgical planning to assist in the treatment of head and neck cancer patients.</p><p>Brendan’s design philosophy was developed during his childhood while growing up in the Canadian Rocky Mountains. Being immersed in the natural environment helped develop his aesthetic which combines honest materials and sustainability with bold structures and silhouettes. Throughout his education and design practice Brendan’s daring designs have been deeply grounded by their simplicity and efficiency in manufacturing.</p><p>Now in charge of leading a diverse team of designers and talented fabricators paired with a full-scale manufacturing facility, Brendan balances his role as a creative with the responsibility of being a organization leader. All of which has come together, Onetwosix being named Industrial Designers of the Year by Western Living Magazine in 2020.</p><p><strong>Description</strong></p><p>Industrial designers conceptualize and produce designs for manufactured products. They are employed by manufacturing industries and private design firms or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>For Technical occupations in architecture, drafting, surveying, geomatics, over the period 2019-2028, new job openings (arising from expansion demand and replacement demand) are expected to total 17,100 , while 38,400 new job seekers (arising from school leavers, immigration and mobility) are expected to be available to fill them..</p><p><strong>Employment Requirements</strong></p><p>A university degree in industrial design, architecture, engineering or A college diploma in industrial design is required. Creative ability, as demonstrated by a portfolio of work, is required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220717_080752_029e472eef90729db26fd2d5dd824815.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "24",
    "wp_id": 468,
    "slug": "episode-024-producer-filmmaker-talk-with-adam-scorgie",
    "title": "24: Producer Filmmaker Talk with Adam Scorgie",
    "image": "https://media.rss.com/thejobtalk/20220706_070732_45227073fc561c3fb414f8a2156d2275.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/episode-024-Producer-Filmmaker-Talk-with-Adam-Scorgie-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=ckmCNDdCsuI",
    "youtube_full": "https://www.youtube.com/watch?v=64nEUPhyfbg",
    "published": 1657137272000,
    "time": "40:16",
    "preview_description": "Adam Scorgie’s plan A has always been to work hard, be humble and take chances; and it has worked tremendously to date.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-024-producer-filmmaker-talk-with-adam-scorgie/\">Producer Filmmaker Talk with Adam Scorgie</a></strong></p><p>Adam Scorgie’s plan A has always been to work hard, be humble and take chances; and it has worked tremendously to date. A father of 3, a loving husband and an acclaimed documentarian, Adam has an astonishing ability to balance his relentless work schedule and his invaluable family time. To date, Adam has produced ten feature films, with two features currently in post-production including ‘Inmate #1: The Rise of Danny Trejo’ and ‘Bisping’, an in-depth look at the life of UFC legend Michael Bisping. His leadership and loyalty to his team has ensured that his future films guarantee to impress and inspire those who watch them.</p><p><strong>Description</strong></p><p>Producers, directors, choreographers and professionals in related occupations oversee and control the technical and artistic aspects of film, television, video game, radio, dance and theatre productions. They are employed by film production companies, radio and television stations, video game companies, broadcast departments, advertising companies, sound recording studios, record production companies and dance companies. They may also be self-employed.</p><p><strong>Job Forecast</strong></p><p>Over the 2016-2018 period, employment in this occupational group grew strongly. The unemployment rate increased slightly to reach 4.1% in 2018, below the national average of 5.8%. However, the unemployment rate for this occupation has been historically below the average of all occupations, mainly because about 60% of the workers are self-employed. The increase in the number of unemployed workers, coupled with a low and stable number of job openings, led to a surge in the number of available workers to fill those vacancies. The mixed signals of key labour market indicators suggests that the number of job seekers was sufficient to fill the job openings in this occupational group.</p><p><strong>Employment Requirements</strong></p><p>A university degree or college diploma in the performing arts, broadcasting, journalism, business administration, theatre production or film studies and Experience in a technical or production occupation in motion pictures, broadcasting or theatre are usually required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220706_070710_b6c5327557c89e9b79e67f418462d6c1.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "23",
    "wp_id": 460,
    "slug": "episode-023-college-head-coach-talk-with-kiera-lyons",
    "title": "23: College Head Coach Talk with Kiera Lyons",
    "image": "https://media.rss.com/thejobtalk/20220706_070719_4919a30f55d6acb3c24ad5514c9e680a.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/episode-023-College-Head-Coach-Talk-with-Kiera-Lyons-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=6AleBXtyV6k",
    "youtube_full": "https://www.youtube.com/watch?v=97o9EuG9s0o",
    "keywords": ["coach", "college"],
    "published": 1657136238000,
    "time": "46:33",
    "preview_description": "We had the pleasure of talking with Kiera Lyons, a college head coach, who grew up in Ryley Alberta, a town of 400 an hour east of Edmonton.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-023-college-head-coach-talk-with-kiera-lyons/\">College Head Coach Talk with Kiera Lyons</a></strong></p><p>Kiera Lyons grew up in Ryley Alberta, a town of 400 an hour east of Edmonton. She played 1A high school basketball as well as a myriad of other sports and athletics.</p><p>After going through the provincial team program and helping re-establish her high school as one of the best 1A programs in the province, she played two years for the Augustana Vikings and helped lead them to their first playoff appearance in 8 years. She then played three years as a Huskie at the University of Saskatchewan- a team that had just graduated 5 starters the season before she arrived. She finished her career as a captain with a Canada West championship and two Final Eight appearances.</p><p>Since moving back to Alberta she has been a mentor, a coach, a public speaker, and a broadcast analyst all within the world of basketball. She has worked with the NAIT women’s program in previous years, as well as the Lakeland Rustlers as a player development coach, and last summer was an assistant coach with the reigning 2021 Canadian Elite Basketball League Champions, The Edmonton Stingers.</p><p>On May 17, 2022 – Kiera was named the head coach of the NAIT Ooks women’s basketball team.</p><p><strong>Description</strong></p><p>Coaches prepare and train individual athletes or teams for competitive events. They are employed by national and provincial sports organizations, professional and amateur sports teams, sports clubs and universities or they may be self-employed. This unit group also includes sports scouts who identify and recruit athletes for professional sports teams. They are employed by professional sports organizations.</p><p><strong>Job Forecast</strong></p><p>The job prospects vary across Canada depending on the province or territory.</p><p><strong>Employment Requirements</strong></p><p>Completion of the National Coaching Certificate program is usually required for individual and team sports coaches in all sports.</p><p>National Coaching Certificate Level 3 is usually required for provincial coaches.</p><p>National Coaching Certificate Level 4 is usually required for coaches of national team athletes.</p><p>A degree in physical education may be required.</p><p>Experience in and technical knowledge of the sport is required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220706_070705_d2990f3926ea3b8468a60b983c5a2d8f.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "22",
    "wp_id": 445,
    "slug": "episode-022-fiction-author-talk-with-michelle-cornish",
    "title": "22: Fiction Author Talk with Michelle Cornish",
    "image": "https://media.rss.com/thejobtalk/20220706_040711_13e1742a10a85bb7362dbed7ff2c1dd5.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/episode-022-Fiction-Author-Talk-with-Michelle-Cornish-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=fYHU1Y7THho",
    "youtube_full": "https://www.youtube.com/watch?v=NzBou9Byuis",
    "keywords": ["Author"],
    "published": 1657125431000,
    "time": "37:56",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-022-fiction-author-talk-with-michelle-cornish/\">Fiction Author Talk with Michelle Cornish</a></strong></p><p>After spending almost 20 years in the public accounting industry, Michelle sold her accounting practice to spend more time with her family and pursue her dream of writing. In 2017, she published Keep More Money, a guide to help business owners find a trustworthy accountant. Realizing that she wanted to write fiction, in 2018, Michelle published Murder Audit, her debut novel and book one in the Cynthia Webber financial crime series. Michelle also writes children’s books with her sons under the pen name AJ Kormon. When she’s not writing, you’ll find Michelle in small-town Canada cartooning and losing to her kids at Uno!</p><p><strong>Description</strong></p><p>Authors and writers plan, research and write books, scripts, storyboards, plays, essays, speeches, manuals, specifications and other non-journalistic articles for publication or presentation. They are employed by advertising agencies, governments, large corporations, private consulting firms, publishing firms, multimedia/new-media companies and other establishments, or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labor supply and demand seen in recent years is expected to continue over the projection period.</p><p>Employment Requirements</p><p>Technical writers usually require a university degree in the area of specialization, such as computer science or engineering.</p><p>Copywriters usually require a university degree or college diploma in French, English, marketing, advertising or another discipline.</p><p>Creative writing programs are offered by universities and colleges.</p><p>Talent and ability, as demonstrated by a portfolio of work, are important hiring criteria.</p><p>Membership in a guild or union related to the occupation may be required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220706_040758_9506d89cbf8ed91159930aad995eeb4a.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "21",
    "wp_id": 437,
    "slug": "episode-021-crime-scene-investigator-talk-with-cst-stephen-berney",
    "title": "21: Crime Scene Investigator Talk with Cst. Stephen Berney",
    "image": "https://media.rss.com/thejobtalk/20220706_040736_e7ef22d5fa138b69daf74fd8494c83bf.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/Episode-021Crime-Scene-Investigator-Talk-with-Cst.-Stephen-Berney-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=IaR3R9FKXV4",
    "youtube_full": "https://www.youtube.com/watch?v=qks2LsqiDXs",
    "keywords": ["Investigator", "police"],
    "published": 1657124676000,
    "time": "42:41",
    "preview_description": "As a Crime Scene Investigator Stephen focused his attention on careers he felt would make the greatest positive impact for the community he lives in.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-021-crime-scene-investigator-talk-with-cst-stephen-berney/\">Crime Scene Investigator Talk with Cst. Stephen Berney</a></strong></p><p>Stephen Berney moved to the Edmonton area with his family in 1999. Stephen attended St. Francis Xavier High School where he was enrolled in the Soccer Academy, which had the highlight of playing exhibition games in Italy. After high school, Stephen attended the University of Alberta where he completed a Bachelor of Science in Kinesiology degree.</p><p>When looking at potential careers, Stephen focused his attention on careers he felt would make the greatest positive impact for the community he lives in. Naturally, the Edmonton Police Service was at the top of his list and 2 months after graduating from university, he was hired in the fall of 2014.</p><p>At the beginning of his career, Stephen met his wife Julia who is also a member of the EPS. In the following 8 years, Stephen worked in Northwest Division in patrol for 5 years, and has now nearly completed his 3rd year in the Crime Scenes Investigation Unit.</p><p>In his free time, Stephen enjoys visiting family and friends, playing soccer, ball hockey, flag football and traveling, notably to visit Julia’s family in Poland.</p><p><strong>Description</strong></p><p>Police officers protect the public, detect and prevent crime and perform other activities directed at maintaining law and order. They are employed by municipal and federal governments and some provincial and regional governments.</p><p>Patrol assigned areas to maintain public safety and order and to enforce laws and regulations.</p><p>Investigate crimes and accidents, execute search warrants, secure evidence, interview witnesses, compile notes and reports and provide testimony in courts of law.</p><p>Apprehend and arrest criminal suspects. Provide emergency assistance to victims of accidents, crimes and natural disasters. Participate in crime prevention, public information and safety programs. May supervise and coordinate the work of other police officers.</p><p><strong>Job Forecast</strong></p><p>Labour demand and labour supply are expected to be broadly in line for this occupation group over the 2019-2028 period at the national level.</p><p><strong>Employment Requirements</strong></p><p>Completion of secondary school is required.</p><p>Completion of a college program or university degree in law and security or in the social sciences is usually required.</p><p>A three- to six-month police training program is provided.</p><p>Physical agility, strength, fitness and vision requirements must be met, and psychological or other tests may also be required.</p><p>Experience as a constable and the completion of specialized courses are required for detectives and sergeants.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220706_040723_60e1d35c06f9e3a6d1284330769a58b7.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "20",
    "wp_id": 430,
    "slug": "episode-020-entrepreneur-talk-with-theresa-smith",
    "title": "20: Entrepreneur Talk with Theresa Smith",
    "image": "https://media.rss.com/thejobtalk/20220706_040751_bd7ca37c2b5807e3278eb433a983ce75.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/Episode-020-Entrepreneur-Talk-with-Theresa-Smith-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=8G5wpeSMXJw",
    "youtube_full": "https://www.youtube.com/watch?v=4o4xSMOrsJQ",
    "keywords": ["Entrepreneur"],
    "published": 1657123671000,
    "time": "39:56",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-020-entrepreneur-talk-with-theresa-smith/\">Entrepreneur Talk with Theresa Smith</a></strong></p><p>Theresa Smith is Co-founder of Optimize Dental. As a leader, teacher and perpetual learner, Theresa finds herself in the amazing field of dentistry. She strives to help dental teams find balance, enrichment and productivity in their everyday tasks. Theresa has 3 wonderful kids who she enjoys spending time with and watching them in their respective sports activities such as basketball, horse showing, and dance. While she continues to create a work life balance, she also enjoys her passions of skiing, traveling, and horses.</p><p><strong>Description</strong></p><p>An entrepreneur is an individual who takes the risk to start their own business based on an idea they have or a product they have created while assuming most of the risks and reaping most of the rewards of the business.</p><p><strong>Job Forecast</strong></p><p>In 2019, there were 1,143,610 active enterprises in Canada with one or more employees. Of those, 64.6% had four employees or less. In the same year, there were 79,530 births and 90,710 deaths of enterprises. The construction sector represented the largest number of high-growth enterprises by employment and by revenue. With 1,140 high-growth enterprises by employment and 2,530 high-growth enterprises by revenue, this sector accounted for 15.9% and 19.5% of the total, respectively.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220706_040738_1e2ab8684bab84a321a11e723c5cf255.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "19",
    "wp_id": 419,
    "slug": "episode-019-registered-massage-therapist-talk-with-jessica-harder",
    "title": "19: Registered Massage Therapist Talk with Jessica Harder",
    "image": "https://media.rss.com/thejobtalk/20220706_120724_3260392b6a060b61cfcc20e246818d89.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/07/Episode-019-Registered-Massage-Therapist-Talk-with-Jessica-Harder.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=JQ_v_ViDfJA",
    "youtube_full": "https://www.youtube.com/watch?v=LStNAXx1v3g",
    "keywords": ["aesthetician", "Registered Massage Therapist"],
    "published": 1657068564000,
    "time": "29:51",
    "preview_description": "Jessica Harder is from Edmonton, Alberta, Canada. She has been an aesthetician for 16 years graduating from Marvel college in 2006.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-019-registered-massage-therapist-talk-with-jessica-harder/\">Registered Massage Therapist Talk with Jessica Harder</a></strong></p><p>Jessica Harder is from Edmonton, Alberta, Canada. She has been an esthetician for 16 years graduating from Marvel college in 2006. She worked in many spas and salons, like Eveline Charles and even did a 9 month contract on Disney Cruise Lines back in 2008. This gave her an attention to detail work ethic, and her – ‘it’s all about the customer’ attitude, as she truly likes to make sure her clients self-care needs are being looked after in a relaxing and comfortable environment. Since 2018, Jessica rents her own studio space and is working for herself. This allowed her to grow her business and gain a loyal, regular base of clients. Looking to grow more, she decided to go back to school in 2020 for Massage Therapy at Vicars School of Massage Therapy in Edmonton. She graduated on June 11, 2022. Jessica is excited to bring her vast knowledge from the spa industry to the more wellness focused goals of massage therapy.</p><p><strong>Description</strong></p><p>Massage therapists assess soft tissues and joints of the body for treatment and prevention of dysfunction, injury, pain and physical disorders. They work in private practice, including group or team practices, hospitals, clinics, extended care facilities, rehabilitation centers and educational institutions.</p><p><strong>Job Forecast</strong></p><p>People working as a registered massage therapist (RMT) have different job prospects depending on where they work in Canada.</p><p><strong>Employment Requirements</strong></p><p>Massage therapists usually require completion of an 18- to 24-month or 18- to 36-month program in massage therapy from an accredited school and a period of supervised practical training. Registration with a regulatory body is required in Newfoundland and Labrador, Ontario and British Columbia.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220706_120712_6bdcd7496793337792d8b9b32680da01.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "18",
    "wp_id": 405,
    "slug": "episode-018-tax-manager-talk-with-yembeh-moiba-cpa",
    "title": "18: Tax Manager Talk with Yembeh Moiba, CPA",
    "image": "https://media.rss.com/thejobtalk/20220613_010609_11ca9167182cb448886f35a2da73bba5.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/06/the-job-talk-episode-018-Tax-Manager-Talk-with-Yembeh-Moiba-CPA.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=ukrues9mzL0",
    "youtube_full": "https://www.youtube.com/watch?v=ooArWssM1VM",
    "keywords": ["accountant", "accounting", "CPA", "manager", "tax"],
    "published": 1655126168000,
    "time": "28:05",
    "preview_description": "Yembeh Moiba, CPA is a Tax Manager at a CPA Public Accounting firm in Edmonton, Alberta, Canada and has had an interesting journey!",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-018-tax-manager-talk-with-yembeh-moiba-cpa/\">Tax Manager Talk with Yembeh Moiba, CPA</a></strong></p><p>Yembeh Moiba, CPA is a Tax Manager at a CPA Public Accounting firm in Edmonton, Alberta, Canada. He is a self described huge sports fan and a serious hiker. If he wasn’t an accountant he would be a chef.</p><p>Yembeh played university football at the University of Alberta where he also competed in track and field. When he isn’t working, you can find him on the sidelines coaching youth football.</p><p><strong>Description</strong></p><p>Financial auditors examine and analyze the accounting and financial records of individuals and establishments to ensure accuracy and compliance with established accounting standards and procedures. Accountants plan, organize and administer accounting systems for individuals and establishments. They are employed by private sector accounting and auditing firms or departments and public sector accounting and auditing departments or units, or they may be self-employed. Articling students in accounting firms are included in this unit group.</p><p><strong>Job Forecast</strong></p><p>People working as a tax accountant have different job prospects depending on where they work in Canada.</p><p><strong>Employment Requirements</strong></p><p>Chartered accountants require a university degree and Completion of a professional training program approved by a provincial institute of chartered accountants and, depending on the province, either two years or 30 months of on-the-job training and Membership in a provincial Institute of Chartered Accountants upon successful completion of the Uniform Evaluation (UFE).</p><p>Certified general accountants and certified management accountants require a university degree and Completion of a training program approved by the Society of Certified General Accountants or Society of Management Accountants and several years of on-the-job training and Certification by the Certified General Accountants Association or the Society of Management Accountants.</p><p>Auditors require education, training and recognition as indicated for chartered accountants, certified general accountants or certified management accountants and Some experience as an accountant.</p><p>Auditors may require recognition by the Institute of Internal Auditors.</p><p>To act as a trustee in bankruptcy proceedings, auditors and accountants must hold a licence as a trustee in bankruptcy.</p><p>Licensing by the provincial or territorial governing body is usually required for accountants and auditors practicing public accounting.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220613_010658_74469524b2b5d50601cb1bcd18134c50.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "17",
    "wp_id": 398,
    "slug": "episode-017-general-contractor-talk-with-tania-bosch",
    "title": "17: General Contractor Talk with Tania Bosch",
    "image": "https://media.rss.com/thejobtalk/20220612_020655_4fa6510baec46c93641482b5f43cc9a1.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/06/The-Job-Talk-Podcast-Episode-017-General-Contractor-Talk-with-Tania-Bosch.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=iX_HchaLSro",
    "youtube_full": "https://www.youtube.com/watch?v=mQgmLXRjlVY",
    "keywords": ["construction", "contractor", "development"],
    "published": 1655043355000,
    "time": "33:33",
    "preview_description": "We talk with Tania about her experience as a General Contractor with experience in land development and the construction industry.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-017-general-contractor-talk-with-tania-bosch/\">General Contractor Talk with Tania Bosch</a></strong></p><p>With over 20 years of experience combined in both the land development and construction industry, Tania brings a variety of experience in high end residential and commercial projects, attention to detail, passion for the industry, and a strong desire to ensure clients have an exceptional experience.</p><p>Construction is easy, people are complicated. It’s this appreciation for the relationship component of a project that helps Bouwen Construction yield success.</p><p>Outside of work, Tania is mom to a 15 yr old son, a 2 yr old dashound, and enjoys staying active and travelling.</p><p><strong>Description</strong></p><p>General Contractors, organize, direct, control and evaluate the activities of a construction company or a construction department within a company, under the direction of a general manager or other senior manager. They are employed by residential, commercial and industrial construction companies and by construction departments of companies outside the construction industry. They can also be self employed.</p><p><strong>Job Forecast</strong></p><p>The job prospects vary across Canada depending on the province or territory.</p><p><strong>Employment Requirements</strong></p><p>A university degree in civil engineering or a college diploma in construction technology is usually required.</p><p>A master’s degree in project management may be required.</p><p>Several years of experience in the construction industry, including experience as a construction supervisor or field superintendent, are usually required.</p><p>Extensive experience in the construction industry may substitute for post-secondary education requirements.</p><p>Professional engineering status or construction trade certification may be required by some employers.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220612_020644_ab1f6713a618124d5fba66bda999969b.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "16",
    "wp_id": 386,
    "slug": "episode-016-registered-professional-planner-talk-with-lindsey-butterfield",
    "title": "16: Registered Professional Planner Talk with Lindsey Butterfield",
    "image": "https://media.rss.com/thejobtalk/20220612_010653_57627c40eb91d4f8433e5f2497793636.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/06/The-Job-Talk-Episode-016-Registered-Professional-Planner-Talk-with-Lindsey-Butterfield.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=dqcmqz1-LEk",
    "youtube_full": "https://www.youtube.com/watch?v=HASJYAUq7RA",
    "keywords": ["Professional Planner"],
    "published": 1655041673000,
    "time": "26:39",
    "preview_description": "We talk with Lindsey Butterfield who is a Registered Professional Planner and Member of the Canadian Institute of Planners.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-016-registered-professional-planner-talk-with-lindsey-butterfield/\">Registered Professional Planner Talk with Lindsey Butterfield</a></strong></p><p>Lindsey Butterfield is a Registered Professional Planner and Member of the Canadian Institute of Planners. She has worked as a city planner in the Edmonton Metro region for nearly two decades, and is passionate about improving the places we live and work in. Lindsey is currently the Director of Urban Growth and Open Space for the City of Edmonton, working on too many interesting projects to list here with a wonderful team.</p><p><strong>Description</strong></p><p>Urban and land use planners develop plans and recommend policies for managing land use, physical facilities and associated services for urban and rural areas and remote regions. They are employed by all levels of government, land developers, engineering and other consulting companies, or may work as private consultants.</p><p><strong>Job Forecast</strong></p><p>The job prospects vary across Canada depending on the province or territory.</p><p><strong>Employment Requirements</strong></p><p>A bachelor’s degree in urban and regional planning, geography, architecture, engineering or a related discipline is required.</p><p>A master’s degree in one of these disciplines may be required.</p><p>Membership in the Canadian Institute of Planners is usually required.</p><p>Membership in a provincial planning institute may be required in some provinces.</p><p>Leadership in Energy and Environmental Design (LEED) certification is offered by the Canada Green Building Council and may be required by some employers.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220612_010641_1a48ed475e8b5bb6f184026636364c68.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "15",
    "wp_id": 378,
    "slug": "episode-015-construction-project-manager-talk-with-mickey-legault",
    "title": "15: Construction Project Manager Talk with Mickey Legault",
    "image": "https://media.rss.com/thejobtalk/20220612_010645_9f0011037f826ea22cb115b58214753d.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/06/The-Job-Talk-Podcast-Episode-015-Construction-Project-Manager-Talk-with-Mickey-Legault.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=tAI-lM2Y_8M",
    "youtube_full": "https://www.youtube.com/watch?v=Rlc17x7O3nU",
    "keywords": ["construction", "manager", "project manager"],
    "published": 1655040345000,
    "time": "29:10",
    "preview_description": "Mickey Legault is a Construction Project Manager and talks with us about his interesting journey into the trades.",
    "description": "<p><strong>Construction Project Manager Talk with Mickey Legault</strong></p><p>Mickey Legault was born and raised in Edmonton, Alberta, Canada. He graduated high school in 2002 – and a year later he met his wife. They were married in 2004, and in 2005 he joined the military as an Armoured Soldier with the Lord Strathcona Horses. He left the Department of National Defence (DND) in 2008 after his wife gave birth to their first child. (Marshall 15, Ross 13, and Rosalie 11). Mickey credits his wife’s love and support that makes him the person he is today.</p><p>The plan out of the military was to move into a career in law enforcement but he had a unique opportunity to help out and learn from the Regiments Carpenter. He decided to give carpentry a chance and looked to renovations in particular as it was a career where you’re inside, warm and dry for most of the time. In 2008 Mickey began his career as a labourer, moving up to apprentice, to journeyman, lead hand, and then was encouraged to take training as a construction supervisor. He completed his training at The Northern Alberta Institute of Technology. In 2016 he was given the opportunity to become a project manager with Quadrant Construction.</p><p><strong>Description</strong></p><p>Construction managers plan, organize, direct, control and evaluate the activities of a construction company or a construction department within a company, under the direction of a general manager or other senior manager. They are employed by residential, commercial and industrial construction companies and by construction departments of companies outside the construction industry.</p><p><strong>Job Forecast</strong></p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>A university degree in civil engineering or a college diploma in construction technology is usually required.</p><p>A master’s degree in project management may be required.</p><p>Several years of experience in the construction industry, including experience as a construction supervisor or field superintendent, are usually required.</p><p>Extensive experience in the construction industry may substitute for post-secondary education requirements.</p><p>Professional engineering status or construction trade certification may be required by some employers.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220612_010633_9186d722d4df64538730df97086faa39.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "14",
    "wp_id": 368,
    "slug": "episode-014-criminal-defence-attorney-talk-with-amy-lind",
    "title": "14: Criminal Defence Attorney Talk with Amy Lind",
    "image": "https://media.rss.com/thejobtalk/20220611_030655_678291dc9a80e3427948dc8efa4a13fa.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/06/The-Job-Talk-Episode-014-Criminal-Defence-Attorney-Talk-with-Amy-Lind.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=QbuXg4lwKZQ",
    "youtube_full": "https://www.youtube.com/watch?v=RTLu1k0Hnvw",
    "keywords": ["Attorney", "Defence Attorney", "lawyer", "the job talk"],
    "published": 1654960315000,
    "time": "32:58",
    "preview_description": "The Job Talk Podcast speaks with Amy Lind, a criminal defence attorney, who is focused on ensuring that all persons, regardless of wealth or status, are given a fair trial.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-014-criminal-defence-attorney-talk-with-amy-lind/\">Criminal Defence Attorney Talk with Amy Lind</a></strong></p><p>Amy Lind is a criminal defence attorney practicing with Liberty Law in Edmonton Alberta. For 10 years she has focused on ensuring that all persons, regardless of wealth or status, are given a fair trial. With a background in Fine Arts and Sociology, she sees the value in a strong community connection and seeks to bring her love of theatre together with justice work. Amy has represented individuals at all levels of Court and all levels of charges from theft unders to homicides. Amy taught at the University of Alberta Law school for a number of years and is often brought back as a guest speaker.</p><p><strong>Description</strong></p><p>Lawyers and Quebec notaries advise clients on legal matters, represent clients before administration boards and draw up legal documents such as contracts and wills. Lawyers also plead cases, represent clients before tribunals and conduct prosecutions in courts of law. Lawyers are employed in law firms and prosecutor's offices. Quebec notaries are employed in notary offices. Both lawyers and Quebec notaries are employed by federal, provincial and municipal governments and various business establishments or they may be self-employed. Articling students are included in this unit group.</p><p><strong>Job Forecast</strong></p><p>As job openings and job seekers are projected to be at relatively similar levels over the 2019-2028 period, the balance between labour supply and demand seen in recent years is expected to continue over the projection period.</p><p><strong>Employment Requirements</strong></p><p>Two to three years of undergraduate studies or, in Quebec, completion of a college program and a bachelor's degree from a recognized law school and successful completion of the bar examination and completion of articling are required. Licensing by the provincial or terr torial law society is required.</p><p><strong>Notaries (Quebec)</strong> A bachelor's degree from a recognized law school and a Diploma of Notarial Law (D.D.N.) or A master's degree of law with specialization in notarial law and A 32-week vocational training program are required.</p><p>Registration with the Corporation of Notaries is required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220611_030644_ce56cee53c2b1b3eb7864a32bb6ea36e.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "13",
    "wp_id": 360,
    "slug": "episode-013-hair-stylist-talk-with-kristin-lingstadt",
    "title": "13: Hair Stylist Talk with Kristin Lingstadt",
    "image": "https://media.rss.com/thejobtalk/20220608_120639_85d1b5e471ed00f20b49407797f74589.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/06/The-Job-Talk-Episode-013-Hair-Stylist-Talk-with-Kristin-Lingstadt.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=JOo6wJdcb1A",
    "youtube_full": "https://www.youtube.com/watch?v=wPrUeT9hegw",
    "keywords": ["hair", "stylist"],
    "published": 1654692999000,
    "time": "24:10",
    "preview_description": "Learn about how Kristin Lingstadt is an entrepreneur and hair stylist in Edmonton Alberta with over 15 years experience in the industry.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-013-hair-stylist-talk-with-kristin-lingstadt/\">Hair Stylist Talk with Kristin Lingstadt</a></strong></p><p>Kristin Lingstadt is an entrepreneur and hair stylist in Edmonton Alberta with over 15 years experience in the industry. After years spent working in downtown salons and participating in exciting projects like fashion week and bridal fantasy, Kristin currently styles hair from her home based salon studio. Kristin has a heart for relationships and creativity which she expresses passionately through her work with clients.</p><p><strong>Description</strong></p><p>Hairstylists and barbers cut and style hair and perform related services. They are employed in hairstyling or hairdressing salons, barber shops, vocational schools, health care establishments and theater, film and television establishments.</p><p><strong>Job Forecast</strong></p><p>People working as a hairstylist have different job prospects depending on where they work in Canada. Labour demand and labour supply are expected to be broadly in line for this occupation group over the 2019-2028 period at the national level.</p><p><strong>Employment Requirements</strong></p><p>Some secondary school education is required. Completion of a two- or three-year hairstyling apprenticeship program or completion of a college or other program in hairstyling combined with on-the-job training is usually required. Several years of experience may replace formal education and training. Employers may require applicants to provide a hairstyling demonstration before being hired. Trade certification for hairstylists is compulsory in Nova Scotia, Ontario, Manitoba, Saskatchewan, and Alberta, and available, but voluntary, in Newfoundland and Labrador, Prince Edward Island, New Brunswick, Quebec, British Columbia, the Yukon, the Northwest Territories and Nunavut. Red Seal endorsement is also available to qualified hairstylists upon successful completion of the interprovincial Red Seal examination.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220608_120628_9ae845f28396644adfc70effb2b80cf8.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "12",
    "wp_id": 328,
    "slug": "episode-012-general-practitioner-talk-with-dr-kim-loeffler",
    "title": "12: General Practitioner Talk with Dr. Kim Loeffler",
    "image": "https://media.rss.com/thejobtalk/20220607_120632_9080e2a60162a18e7131379934363406.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/05/Kim-Louffler-General-Practitioner-the-job-talk.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=c4F_A4ssguU",
    "youtube_full": "https://www.youtube.com/watch?v=07QRJgFpktA",
    "keywords": ["General Practitioner", "physician"],
    "published": 1654562972000,
    "time": "21:46",
    "preview_description": "General practitioners and family physicians diagnose and treat the diseases, physiological disorders and injuries of patients.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-012-general-practitioner-talk-with-dr-kim-loeffler/\">General Practitioner Talk with Dr. Kim Loeffler</a></strong></p><p>Dr. Kim Loeffler - MD, BSc, CCFP, graduated from B. Sc Mathematical Science from the University of Alberta in 1999 and was accepted into medical school at the UofA in 2000. Kim entered her family medicine residency in 2004 and completed the 2 year residency program in 2007 with a delay due to the birth of her first daughter. She has spent the majority of her career as a faculty advisor for family medicine residents at the University of Alberta. Recently, however, Kim transitioned the majority of her time to working within the hospital setting. She also worked for the College of Physicians and Surgeons where she carrys out physician assessments and help with physician complaints.</p><p><strong>Description</strong></p><p>General practitioners and family physicians diagnose and treat the diseases, physiological disorders and injuries of patients. They provide primary contact and continuous care toward the management of patients' health. They usually work in private practice, including group or team practices, hospitals and clinics. Residents in training to be general practitioners or family physicians are included in this unit group.</p><p><strong>Job Forecast</strong></p><p>The employment outlook will be good for General practitioners and family physicians for the 2021-2023 period.</p><p><strong>Employment Requirements</strong></p><p>A bachelor's degree or In Quebec, completion of a college program and one year of pre-medicine university studies is usually required.</p><p>Graduation from an approved medical school and Two to three years of family medicine residency training are required.</p><p>Completion of the qualifying examinations of the Medical Council of Canada and Licensing by the provincial or territorial licensing authority are required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220607_120621_d4caed8d577e31cef4f6af3ee76d1aec.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "11",
    "wp_id": 347,
    "slug": "episode-011-police-officer-talk-with-sgt-kendall-booth",
    "title": "11: Police Officer Talk with Sgt. Kendall Booth",
    "image": "https://media.rss.com/thejobtalk/20220605_080610_c6271df31b1ffe831e0f12dd858d3cdf.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/06/episode-011-police-officer-talk-with-sgt-kendall-booth.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=0D42J6qjR30",
    "youtube_full": "https://www.youtube.com/watch?v=D723IWGuwLg",
    "keywords": ["officer", "police"],
    "published": 1654462210000,
    "time": "35:38",
    "preview_description": "We interview a Police Sergeant, Kendall Booth, who is currently a sergeant in the Young People Support Branch of the Edmonton Police Service.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-011-police-officer-talk-with-sgt-kendall-booth/\">Police Officer Talk with Sgt. Kendall Booth</a></strong></p><p>Kendall Booth is currently a sergeant in the Young People Support Branch of the Edmonton Police Service. He has 13 years of policing experience in different areas of the EPS and was a teacher for 15 years prior to that.</p><p><strong>Description</strong></p><p>Police officers protect the public, detect and prevent crime and perform other activities directed at maintaining law and order. They are employed by municipal and federal governments and some provincial and regional governments.</p><p><strong>Job Forecast</strong></p><p>The employment outlook will be good for Police officers.</p><p><strong>Employment Requirements</strong></p><p>Completion of secondary school is required.</p><p>Completion of a college program or university degree in law and security or in the social sciences is usually required.</p><p>A three- to six-month police training program is provided.</p><p>Physical agility, strength, fitness and vision requirements must be met, and psychological or other tests may also be required.</p><p>Experience as a constable and the completion of specialized courses are required for detectives and sergeants.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220605_080653_1c0be21588beea2b1d1144e66bd72518.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "10",
    "wp_id": 336,
    "slug": "episode-010-journeyman-carpenter-talk-with-bobby-hakkarainen",
    "title": "10: Journeyman Carpenter Talk with Bobby Hakkarainen",
    "image": "https://media.rss.com/thejobtalk/20220525_050504_b27225cb17ec717b6eb5fea2ca62db35.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/05/BobbyHakkarainen-PosterImage.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=wUzQN_0QZUE",
    "youtube_full": "https://www.youtube.com/watch?v=h10a588hG6w",
    "keywords": ["carpenter", "carpentry", "construction", "journeyman"],
    "published": 1653499264000,
    "time": "35:00",
    "preview_description": "After spending many years working on high-rise buildings, Bobby transitioned to apply his trade in a successful career on the sets of television and film.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-010-journeyman-carpenter-talk-with-bobby-hakkarainen/\">Journeyman Carpenter Talk with Bobby Hakkarainen</a></strong></p><p>Bobby Hakkarainen lives and works in Vancouver, British Columbia. After spending many years working on high-rise buildings, Bobby transitioned to apply his trade in a successful career on the sets of television and film. Bobby loves his career and offers honest advice to those considering carpentry. If you have time, listen to the full episode to hear stories about working on the sets of both television and film.</p><p><strong>Description</strong></p><p>Carpenters construct, erect, install, maintain and repair structures and components of structures made of wood, wood substitutes, lightweight steel and other materials. They are employed by construction companies, carpentry contractors, and maintenance departments of factories, plants and other establishments, or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>The outlook for carpenters in the region is good. An aging workforce, new housing and renovation projects, and mass timber construction projects will drive the need for skilled workers.</p><p><strong>Employment Requirements</strong></p><p>Completion of secondary school is usually required. Completion of a three- to four-year apprenticeship program or A combination of over four years of work experience in the trade and some high school, college or industry courses in carpentry is usually required to be eligible for trade certification. Trade certification for carpenters is compulsory in Quebec and available, but voluntary, in all other provinces and the territories. Trade certification for framers is available, but voluntary, in Saskatchewan. Red Seal endorsement is also available to qualified carpenters upon successful completion of the interprovincial Red Seal examination.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220525_050541_001843428e73337b5edb98b9c9814cd1.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "9",
    "wp_id": 299,
    "slug": "episode-009-journalist-communicator-talk-with-davis-sheremata",
    "title": "9: Journalist & Communicator Talk with Davis Sheremata",
    "image": "https://media.rss.com/thejobtalk/20220422_120423_c05682af554583f1a43bb4374574935e.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/04/Journalist-Communicator-Talk-with-Davis-Sheremata-the-job-talk-podcast.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=mpoibsrgrDA",
    "youtube_full": "https://www.youtube.com/watch?v=MWhAnWy06FE",
    "keywords": ["Communicator", "Journalist"],
    "published": 1650632183000,
    "time": "44:39",
    "preview_description": "Davis Sheremata is a former journalist and speechwriter living in Calgary. A professional communicator, he is also writer and producer.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-009-journalist-communicator-talk-with-davis-sheremata/\">Journalist & Communicator Talk with Davis Sheremata</a></strong></p><p>Davis Sheremata is a former journalist and speechwriter living in Calgary. A professional communicator, he is also writer and producer of the upcoming Simultaneous fiction series.</p><p><strong>Description</strong></p><p>Journalists research, investigate, interpret and communicate news and public affairs through newspapers, television, radio and other media. They are employed by radio and television networks and stations, newspapers and magazines. Journalists may also work on a freelance basis.</p><p><strong>Job Forecast</strong></p><p>The job prospects vary across Canada and the US.</p><p><strong>Employment Requirements</strong></p><p>University education is usually required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220422_120457_114b53fb4266a43a66e6135544bb0b62.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "8",
    "wp_id": 279,
    "slug": "episode-008-interior-design-talk-with-brenda-brix",
    "title": "8: Interior Design talk with Brenda Brix",
    "image": "https://media.rss.com/thejobtalk/20220330_120328_f2c39e227d4caf613fce9c15918e1bcd.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/Job-Talk-Podcast-Episode-008-interior-design-Brenda-Brix.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=enoGAVBWJnM",
    "youtube_full": "https://www.youtube.com/watch?v=k97Q6Q-c2uY",
    "keywords": ["interior design"],
    "published": 1648644508000,
    "time": "25:51",
    "preview_description": "Interior Designer speaks to owning and operating a business and shares her experiences of working in a career she’s passionate about.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-008-interior-design-talk-with-brenda-brix/\">Interior Design talk with Brenda Brix</a></strong></p><p>Brenda Brix – BSc, is the Principal and Owner of AMR Design, one of Alberta’s leading interior design firms. She uses her more than 20 years of experience to lead an award winning design team. Brenda speaks to owning and operating a business and shares her experiences of working in a career she’s passionate about.</p><p><strong>Description</strong></p><p>Interior designers and interior decorators conceptualize and produce aesthetic, functional and safe designs for interior spaces in residential, commercial, cultural, institutional and industrial buildings. They are employed by architectural and interior design firms, retail establishments, construction companies, hospitals, airlines, hotel and restaurant chains, and other establishments, or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>This occupational group is expected to face labour shortage conditions over the period of 2019-2028 at the national level.</p><p><strong>Employment Requirements</strong></p><p>A university degree or college diploma in interior design is usually required. The National Council for Interior Design Qualification (NCIDQ) examination may be required after six years of combined study and experience. Certification by a provincial institute or association is required to use the designation Interior Design Consultant (IDC) in Nova Scotia, New Brunswick, Ontario, Manitoba, Saskatchewan, Alberta and British Columbia.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220330_120313_4835477c3a6803a7b4a7d231a485b3de.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "7",
    "wp_id": 262,
    "slug": "episode-007-family-nurse-practitioner-talk-with-colleen-booth",
    "title": "7: Family Nurse Practitioner talk with Colleen Booth",
    "image": "https://media.rss.com/thejobtalk/20220323_100305_52c783122032d2887b9f6d99209baf0e.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/youtube-thumbnail.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=8skABDBUz_k",
    "youtube_full": "https://www.youtube.com/watch?v=fYJ2bZ4B7_s",
    "keywords": ["Family Nurse Practitioner"],
    "published": 1648076225000,
    "time": "35:24",
    "preview_description": "We talk with a Family Nurse Practitioner about her career path, and the challenges this type of job entails.",
    "description": "<p><strong><a href=\"https://thejobtalk.com/episode-007-family-nurse-practitioner-talk-with-colleen-booth/\">Family Nurse Practitioner Talk with Colleen Booth</a></strong></p><p>Colleen Booth - BSN, MScN, FNP, NP(F) is a Family Nurse Practitioner who resides in Prince George, BC. Colleen graduated with Bachelor of Science degree from UBC followed by a 3 year career in acute medical surgical nursing. In 2011 she graduated with a Master’s in Nursing/Family Nurse Practitioner from UNBC. She provides primary health care to patients in Prince George who do not have a family physician.</p><p><strong>Description</strong></p><p>Primary health practitioners include nurse practitioners, physician assistants and midwives who provide primary health care and treatment in conjunction with physicians and in collaboration with other health professionals. Nurse practitioners and physician assistants provide a range of health services to patients delivering preventive and continuous care toward the management of patients' health. Nurse practitioners are employed in community health centres, hospitals, clinics and rehabilitation centres.</p><p><strong>Job Forecast</strong></p><p>This occupational group is expected to face labour shortage conditions over the period of 2019-2028 at the national level. Employment Requirements Nurse practitioners usually require a master's degree in nursing; or completion of a nursing program with additional advanced or extended primary health care nursing education; and several years of practice as a registered nurse. Registration with a regulatory body is required for nurse practitioners in all provinces and territories. Physician assistants require completion of a university degree in a physician assistant program.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220323_100352_e3eb8846255823d25c2d1d436c92326a.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "6",
    "wp_id": 135,
    "slug": "episode-006-writer-and-editor-talk-with-scott-messenger",
    "title": "6: Writer and Editor Talk with Scott Messenger",
    "image": "https://media.rss.com/thejobtalk/20220322_020354_d56489cc2743a2cde2841d7650ff0c61.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/the-job-talk-podcast-Episode006-Scott-Messenger-writer-editor-career.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=ZSZuqyO9S04",
    "youtube_full": "https://www.youtube.com/watch?v=Y1eOeSxlWwU",
    "keywords": ["career", "editor", "job", "writer", "writing career"],
    "published": 1647961134000,
    "time": "30:11",
    "preview_description": "Scott Messenger offers some great advice to people considering a career as a writer in this Podcast episode of The Job Talk.",
    "description": "<p>Episode Notes Found Here: <a href=\"https://thejobtalk.com/episode-006-writer-and-editor-talk-with-scott-messenger/\">https://thejobtalk.com/episode-006-writer-and-editor-talk-with-scott-messenger/</a></p><p><strong>Writer and Editor Talk with Scott Messenger</strong></p><p>Scott Messenger – BSc, is a magazine writer and editor based in the Edmonton area. Scott graduated from the University of Alberta with a Bachelor of Science degree, specializing in Cell Biotechnology. He is the author of Tapping the West, the story of Alberta’s craft beer boom, published in May 2020 by Touchwood Editions. Scott offers some great advice to people considering a career as a writer.</p><p><strong>Description</strong></p><p>Authors and writers plan, research and write books, scripts, storyboards, plays, essays, speeches, manuals, specifications and other non-journalistic articles for publication or presentation. They are employed by advertising agencies, governments, large corporations, private consulting firms, publishing firms, multimedia/new-media companies and other establishments, or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>Labour demand and labour supply are expected to be broadly in line for this occupation group over the 2019-2028 period at the national level.</p><p><strong>Employment Requirements</strong></p><p>Technical writers usually require a university degree in the area of specialization, such as computer science or engineering. Copywriters usually require a university degree or college diploma in French, English, marketing, advertising or another discipline. Creative writing programs are offered by universities and colleges. Talent and ability, as demonstrated by a portfolio of work, are important hiring criteria. Membership in a guild or union related to the occupation may be required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220322_020343_1f1bfbaac39196f5754c229ab0db6793.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "5",
    "wp_id": 65,
    "slug": "podiatry-talk-with-dr-jerad-booth",
    "title": "5: Podiatry Talk with Dr. Jerad Booth",
    "image": "https://media.rss.com/thejobtalk/20220322_020316_5b91ab830cb00bcf354b70616b4b1a8f.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/The-Job-Talk-Podcast-Episode-005-Dr-Jerad-Booth-Podiatry-Career.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=tvuMzbknDnw",
    "youtube_full": "https://www.youtube.com/watch?v=PJ0WAOyLA9E",
    "keywords": ["Podiatrist", "Podiatry"],
    "published": 1647960555000,
    "time": "42:16",
    "preview_description": "Podiatry Talk with a Podiatrist who is currently in his second year of a three-year surgical residency program for Foot & Ankle Surgery.",
    "description": "<p>Episode Notes Found Here: <a href=\"https://thejobtalk.com/podiatry-talk-with-dr-jerad-booth/\">https://thejobtalk.com/podiatry-talk-with-dr-jerad-booth/</a></p><p><strong>Podiatry Talk with Dr. Jerad Booth</strong></p><p>Dr. Jerad Booth – DPM, is a Canadian citizen living in Detroit, currently in his second year of a three-year surgical residency program for Foot & Ankle Surgery. He graduated high-school in Canada in 2010, attended two universities culminating in a Bachelor’s Degree in General Biology with a minor in General Chemistry from Walla Walla University in Washington in 2015, and completed his scholastic endeavours by graduating with a podiatry medical degree from the California School of Podiatric Medicine.</p><p><strong>Description</strong></p><p>Diagnose diseases, deformities and injuries of the human foot and communicate diagnoses to patients. Treat patients using braces, casts, shields, orthotic devices, physical therapy or prescribe medications. Treat patients with manipulative therapy, medications or surgery.</p><p><strong>Job Forecast</strong></p><p>This occupational group is expected to face labor shortage conditions over the period of 2019-2028 at the national level.</p><p><strong>Employment Requirements</strong></p><p>A four year doctoral degree program in podiatric medicine available in the United States and in Quebec, normally following a completion of a bachelor’s degree program, is required. A medical residency is required in Alberta and British Columbia. A doctor of podiatric medicine degree is required to practice podiatry in Quebec, Ontario, Albert and British Columbia.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220322_020348_90d0185bffc879ef329cb908ba3c7b35.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "4",
    "wp_id": 129,
    "slug": "episode-004-audiovisual-communications-talk-with-robert-belland",
    "title": "4: Audiovisual Talk with Robert Belland",
    "image": "https://media.rss.com/thejobtalk/20220322_020309_66d069d262c9e380502bafbe549de934.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/the-job-talk-podcast-Episode004-RobertBelland-audiovisual.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=wzt6Y5kRCXw",
    "youtube_full": "https://www.youtube.com/watch?v=WDqDgJECFE4",
    "keywords": [
      "audio school",
      "audio visual",
      "audiovisual",
      "av career",
      "career",
      "career in av",
      "job",
      "video school"
    ],
    "published": 1647959949000,
    "time": "39:11",
    "preview_description": "We have an Audiovisual Communications Talk with Robert about having an audiovisual career as a nerd and technician.",
    "description": "<p>Episode Notes Found Here: <a href=\"https://thejobtalk.com/episode-004-audiovisual-communications-talk-with-robert-belland/\">https://thejobtalk.com/episode-004-audiovisual-communications-talk-with-robert-belland/</a></p><p><strong>Audiovisual Talk with Robert Belland</strong></p><p>Robert Belland graduated from MacEwan University with a diploma in Audiovisual Communications. With over 20 years experience in media production, Robert Belland is the owner and operator of Seminar Techs, a company that manages, directs and produces live events. An entrepreneur at heart and a self professed tech nerd with social skills, Rob talks about his experiences running his own business.</p><p><strong>Description</strong></p><p>Audio and video recording technicians operate equipment to record, mix and edit sound, music and videotape, for motion pictures, television and radio programs, videos, recordings and live events. They are employed by multimedia companies, film, video and concert production companies, sound recording firms, theatre and dance companies, educational establishments, clubs, hotels, bands, radio stations, television networks and video production and editing companies.</p><p><strong>Job Forecast</strong></p><p>The employment outlook will be fair for Audio and video recording technicians for the 2021-2023 period. Employment growth will lead to a few new positions. A moderate number of positions will become available due to retirements.</p><p><strong>Employment Requirements</strong></p><p>Completion of a college or other program in recording engineering, audiovisual technology or a related field or Experience as a recording studio assistant is usually required. Senior occupations in this unit group, such as recording and sound engineers, require experience.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220322_020301_92f1571a41ab700c9275bb18edbc9fe5.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "3",
    "wp_id": 121,
    "slug": "episode-003-sales-talk-with-francois-bourdeau",
    "title": "3: Sales Talk with Francois Bourdeau",
    "image": "https://media.rss.com/thejobtalk/20220322_020332_ad2697e3e3fa2183637cf670c5d5a8b9.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/The-Job-Talk-Podcast-Episode-003-Francois-Bourdeau-sales-career.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=5RjvzrK-WGc",
    "youtube_full": "https://www.youtube.com/watch?v=cwVovDRwUKk",
    "keywords": [
      "career",
      "career in sales",
      "job",
      "podcast",
      "sales",
      "selling products"
    ],
    "published": 1647959011000,
    "time": "32:08",
    "preview_description": "Sales Talk with sales expert Francois gives us insights into the career path of someone interested in sales and marketing.",
    "description": "<p>Episode Notes Found Here: <a href=\"https://thejobtalk.com/episode-003-sales-talk-with-francois-bourdeau/\">https://thejobtalk.com/episode-003-sales-talk-with-francois-bourdeau/</a></p><p><strong>Sales Talk with Francois Bourdeau</strong></p><p>Francois Bourdeau has been working in the technology industry since 1999. In 2008, he made the transition to technical pre-sales and, after three years, moved into a pure sales role. In 2020 he and three other sales professionals started 5onFriday, a place for sales professionals to practice their pitch and receive feedback from other sales professionals.</p><p><strong>Description</strong></p><p>Technical sales specialists, wholesale trade, sell a range of technical goods and services, such as scientific, agricultural and industrial products, electricity, telecommunications services and computer services, to governments and to commercial and industrial establishments in domestic and international localities. They are employed by establishments that produce or provide technical goods and services, such as pharmaceutical companies, industrial equipment manufacturing companies, grain elevators, computer services firms, engineering firms and hydroelectric companies, or they may be self-employed technical sales specialists/agents who contract their services to other companies. Technical sales specialists who are supervisors are included in this unit group.</p><p><strong>Job Forecast</strong></p><p>Labour demand and labour supply are expected to be broadly in line for this occupation group over the 2019-2028 period at the national level.</p><p><strong>Employment Requirements</strong></p><p>A University degree or college diploma is usually required. Experience in sales or in a technical occupation related to the product or service may be required. Fluency in a specific foreign language may be required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220322_020318_b9ef0adaff98d1df0dd81de9d33da85d.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "2",
    "wp_id": 42,
    "slug": "episode-002-engineering-with-colin-brook",
    "title": "2: Mechanical Engineering Talk with Colin Brook",
    "image": "https://media.rss.com/thejobtalk/20220322_020332_f1339911541a17e6714bdbfe583d0854.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/MECHANICAL-ENGINEER-Colin-Brook-EPISODE-002.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=VXTL3LCUYXI",
    "youtube_full": "https://www.youtube.com/watch?v=IUIZ6dm1vRc",
    "keywords": [
      "career",
      "Engineering",
      "job",
      "mechanical engineer",
      "Mechanical Engineering",
      "mechanical engineering career"
    ],
    "published": 1647958412000,
    "time": "24:24",
    "preview_description": "Mechanical engineers research, design and develop machinery and systems for heating, power generation, transportation, and manufacturing.",
    "description": "<p>Episode Notes Found Here: <a href=\"https://thejobtalk.com/episode-002-engineering-with-colin-brook/\">https://thejobtalk.com/episode-002-engineering-with-colin-brook/</a></p><p><strong>Mechanical Engineering Talk with Colin Brook</strong></p><p>Colin Brook – P.Eng, is President of WIKA Instruments Ltd. and is a graduate of Mechanical Engineering from the University of Alberta. He is a huge proponent of reflection and takes pride in setting a vision, setting goals and achieving powerful results.</p><p><strong>Description</strong></p><p>Mechanical engineers research, design and develop machinery and systems for heating, ventilating and air conditioning, power generation, transportation, processing and manufacturing. They also perform duties related to the evaluation, installation, operation and maintenance of mechanical systems. They are employed by consulting firms, by power-generating utilities and in a wide range of manufacturing, processing and transportation industries, or they may be self-employed.</p><p><strong>Job Forecast</strong></p><p>This occupational group is expected to face labor shortage conditions over the period of 2019-2028 at the national level.</p><p><strong>Employment Requirements</strong></p><p>University – Bachelor’s degree in mechanical engineering. A master’s degree or doctorate in a related engineering discipline may be required. Licensing by a provincial or territorial association of professional engineers is required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220322_020321_ee9aa47c63ed0dcd5a0b01d933fc528b.mp3",
      "type": "audio/mpeg"
    }
  },
  {
    "episode_id": "1",
    "wp_id": 76,
    "slug": "episode-001-dentistry-talk-with-dr-leanne-ball",
    "title": "1: Dentistry Talk with Dr. Leanne Ball",
    "image": "https://media.rss.com/thejobtalk/20220322_010302_3cf783bd3e76c82e945fe4c58068e80d.jpg",
    "banner_image": "https://thejobtalk.com/wp-content/uploads/2022/03/DENTIST-LEANNEBALL-POSTERIMAGE.jpg",
    "youtube_preview": "https://www.youtube.com/watch?v=1RPsvk3cR2M",
    "youtube_full": "https://www.youtube.com/watch?v=DXlbBL4HCAI",
    "keywords": ["dental career", "dental school", "dentist", "dentistry"],
    "published": 1647889319000,
    "time": "25:50",
    "preview_description": "We talk with Dr. Leanne Ball - DDS, graduated from the University of Alberta in 2016, to learn more about a career path in Dentistry.",
    "description": "<p>Episode Notes Found Here: <a href=\"https://thejobtalk.com/episode-001-dentistry-talk-with-dr-leanne-ball/\">https://thejobtalk.com/episode-001-dentistry-talk-with-dr-leanne-ball/</a></p><p><strong>Dentistry Talk with Dr. Leanne Ball</strong></p><p>Dr. Leanne Ball – DDS, graduated from the University of Alberta in 2016. There she earned her DDS degree, a doctorate of dental surgery. A forever student, she is continuously educating herself and her team in new techniques to provide improved dental services. Her goal is to provide excellent service and create exceptional value through her dental clinic, helping as many people as possible to become healthier, happier, and to smile more.</p><p><strong>Description</strong></p><p>Dentists diagnose, treat, prevent and control disorders of the teeth and mouth. They work in private practice or may be employed in hospitals, clinics, public health facilities or universities.</p><p><strong>Job Forecast</strong></p><p>This occupational group is expected to face labour shortage conditions over the period of 2019-2028 at the national level.</p><p><strong>Employment Requirements</strong></p><p>One to four years of pre-dentistry university studies or, in Quebec, completion of a college program in sciences and a university degree from a recognized dental program are required.</p><p>Licensing by a provincial or territorial regulatory body is required.</p><p>Dentists in general practice can move into a specialized practice through advanced training licensing for specializations is required.</p><p>Stressed about work? Check out our Career Crisis Interview Series: <a href=\"https://thejobtalk.com/help\">https://thejobtalk.com/help</a></p>",
    "audio": {
      "src": "https://media.rss.com/thejobtalk/20220321_070345_3b20563354bc4b3b9e131a3683fb9c20.mp3",
      "type": "audio/mpeg"
    }
  }
]
